{
    "col_count": 54,
    "col_names": [
        "ï»¿stress",
        "hindex",
        "tenured",
        "subjective.happyness",
        "country",
        "tenure.age",
        "Unnamed: 0",
        "Timestamp",
        "How stressed are you because of work?",
        "What is your h-index?",
        "SubjectiveHappinessIndex",
        "At what age did you got tenure? (type 0 if not yet)",
        "Following are 4 questions about subjective happiness... 1.  In general, I consider myself...",
        "2.  Compared with most of my peers, I consider myself:",
        "3.  Some people are generally very happy.  They enjoy life regardless of what is going on, getting the most out of everything.  To what extent does this characterization describe you?",
        "4.  Some people are generally not very happy.  Although they are not depressed, they never seem as happy as they might be.  To what extent does this characterization describe you?",
        "Do you use any reference management tool? ( Mendeley, Zotero, Citationsy, ... )",
        "Would you like to help in a next survey   ?",
        "Your role is...",
        "Any other comments, suggestions, or questions you'd add...",
        "ref",
        "an email for follow-up in a few months",
        "Before we start the survey, we need your consent.",
        "Would you like to help in a next survey  (in a few months time) ?",
        "email",
        "Title Length ceil10",
        "subject_1",
        "subject_2",
        "subject_3",
        "subject_4"
    ],
    "description": "\nto cite this data set: J. Berengueres and P. Nesterov, “A Survey of H-index, Stress, Tenure & Reference Management software use in Academia.”  https://arxiv.org/abs/2010.00358v3 https://arxiv.org/abs/2010.00358v3 \n\n### Survey\n\nhttps://docs.google.com/forms/d/e/1FAIpQLScmphRiVkyiPsGYd4zka6aDaOI-GgftbktoLvdqNjjfY_KabA/viewform?usp=sf_link\n\n### Context\n\nRecommendation feeds are already found in the likes of GoogleScholarTM and ResearchGateTM. However, given the popularization of these tools, it is worth considering their impact on research and researchers. Surprisingly, very little is known about the impact of these tools on academic performance, productivity or well-being of their users. Are academics that use reference management tools more productive? Are they happier? A literature search yields very few results. [12] evaluated ethical conflicts of interest found in Google Scholar algorithms; [13] compared the existing tools; [14] investigated how ResearchGate metrics can be used to infer the performance of a researcher. However, none considers the well-being of researchers.\n\n### Content\n\nData of the survey was collected from 2020-07-09 to 2020-09- 28. The data was generated by emailing authors who had authored or co-authored at least one paper in a popular preprint server service in the past 3 years (Arxiv)[15]. In total, 2286 responses were collected. The survey consisted of 10 questions. \n\n### Acknowledgements\n\nWe would like to thank Cenk Dominic Özbakır for technical support and to the participants in the survey. In particular the ones whose feedback helped improve the design of the survey.\n\n### Inspiration\n\nYour data will be in front of the world's largest data science community. What questions do you want to see answered?",
    "licenses": [
        {
            "hasName": true,
            "name": "ODbL-1.0",
            "nameNullable": "ODbL-1.0"
        }
    ],
    "null_count": 49406,
    "num_entries": 121398,
    "row_count": 6517,
    "source": "kaggle",
    "tags": [
        "business",
        "education",
        "social science",
        "psychology"
    ],
    "title": "Survey Academics ",
    "topic": "academics",
    "usability": 0.9705882352941176
}