{
    "col_count": 10,
    "col_names": [
        "Year",
        "Town Code",
        "Town",
        "2010 Census Units",
        "Government Assisted",
        "Tenant Rental Assistance",
        " Single Family CHFA/ USDA Mortgages",
        "Deed Restricted Units",
        "Total Assisted Units",
        "Percent Affordable"
    ],
    "description": "The Affordable Housing Appeals Procedure List is published annually on or about February 1. The data for the Affordable Housing Appeals Procedure List comes from different sources including federal, state and local programs. This makes it difficult to ensure complete accuracy, so DOH asks municipalities to provide a local administrative review of and input on the street addresses of units and projects as well as information on deed-restricted units. The responses received by DOH vary widely from each municipality.\n\nIn developing the Affordable Housing Appeals Procedure List, DOH counts:\n\n-Assisted housing units or housing receiving financial assistance under any governmental program for the construction or substantial rehabilitation of low and moderate income housing that was occupied or under construction by the end date of the report period for compilation of a given year’s list; -Rental housing occupied by persons receiving rental assistance under C.G.S. Chapter 138a (State Rental Assistance/RAP) or Section 142f of Title 42 of the U.S. Code (Section 8); -Ownership housing or housing currently financed by the Connecticut Housing Finance Authority and/or the U.S. Department of Agriculture; and -Deed-restricted properties or properties with deeds containing covenants or restrictions that require such dwelling unit(s) be sold or rented at or below prices that will preserve the unit(s) as affordable housing as defined in C.G.S. Section 8-39a for persons or families whose incomes are less than or equal to 80% of the area median income.",
    "licenses": [
        {
            "hasName": true,
            "name": "U.S. Government Works",
            "nameNullable": "U.S. Government Works"
        }
    ],
    "null_count": 1,
    "num_entries": 20250,
    "row_count": 2025,
    "source": "kaggle",
    "tags": [
        "housing",
        "finance",
        "real estate",
        "investing",
        "social issues and advocacy"
    ],
    "title": "Affordable Housing by Town 2011-2022",
    "topic": "housing",
    "url": "kaggle.com/datasets/utkarshx27/affordable-housing-by-town-2011-2022",
    "usability": 1.0
}