{
    "col_count": 9,
    "col_names": [
        "ï»¿NGA",
        "Variable",
        "Value From",
        "Value To",
        "Value Note",
        "Date From",
        "Date To",
        "Unit",
        "Explanation"
    ],
    "description": "### Context\n\nThe Seshat: Global History Databank is an international scientific research project of the nonprofit Evolution Institute. Founded in 2011, the Seshat: Global History Databank gathers data into a single, large database that can be used to test scientific hypotheses. The Databank consults directly with expert scholars to code what historical societies and their environments were like in the form of accessible datapoints and thus forms a digital storehouse for data on the political and social organization of all human groups from the early modern back to the ancient and neolithic periods.The organizers of this research project contend that the mass of data then can be used to test a variety of competing hypotheses about the rise and fall of large-scale societies around the globe which may help science provide answers to global problems.\n\n### Acknowledgements\n\nhttps://en.wikipedia.org/wiki/Seshat_(project)\n\nTurchin, P., R. Brennan, T. E. Currie, K. Feeney, P. François, […] H. Whitehouse. 2015. “Seshat: The Global History Databank.” Cliodynamics 6(1): 77–107. https://doi.org/10.21237/C7clio6127917.\n\nTurchin, P., T. Currie […] H. Whitehouse. Preprint. “A New Approach to Estimating Productivity in Past Societies using Seshat: Global History Databank.”",
    "licenses": [
        {
            "hasName": true,
            "name": "CC-BY-NC-SA-4.0",
            "nameNullable": "CC-BY-NC-SA-4.0"
        }
    ],
    "null_count": 840,
    "num_entries": 2970,
    "row_count": 330,
    "source": "kaggle",
    "tags": [
        "business",
        "education",
        "classification"
    ],
    "title": "AgriSeshat: Agriculture Dataset",
    "topic": "agriculture",
    "url": "kaggle.com/datasets/usharengaraju/agriseshat-agriculture-dataset",
    "usability": 0.9411764705882353
}