{
    "col_count": 42,
    "col_names": [
        "County/Sub County",
        "Total",
        "Farming",
        "Crop Production",
        "Livestock Production",
        "Aquaculture",
        "Fishing",
        "Irrigation",
        "Maize",
        "Sorghum",
        "Rice",
        "Potatoes",
        "Beans",
        "Cassava",
        "Sweet Potatoes",
        "Wheat",
        "Green grams",
        "Bananas",
        "Cabbages",
        "Tomatoes",
        "Onions",
        "Ground Nuts",
        "Millet",
        "Watermelons",
        "Kales",
        "Sugarcane",
        "Cotton",
        "Exotic cattle 0Dairy",
        "Exotic cattle 0Beef",
        "Indigenous cattle",
        "Sheep",
        "Goats",
        "Camels",
        "Donkeys",
        "Pigs",
        "Indigenous Chicken",
        "Exotic Chicken Layers",
        "Exotic Chicken Broilers",
        "Beehives",
        "Rabbits",
        "Fish Ponds",
        "Fish Cages"
    ],
    "description": "# Kenya Agriculture\n\nAgriculture is the engine of economic growth in Kenya.  About 75% of Kenyans earn all or part of their income from this sector.  Agriculture accounts for 33% of the nation's gross domestic product (GDP).  Despite continuous population growth, agricultural productivity has stagnated in recent years.  Only 20% of Kenyan land is suitable for farming and that land is not utilized efficiently. Recurrent crises such as drought add to agricultural challenges.  In response to these challenges, USAID is increasing productivity for smallholder farmers.\n\n### Summary\n\nThe dataset contains a summary of the distribution of households practicing agriculture by county and sub-county level. Kenya currently has 47 counties (states) which contain several sub-counties. The dataset is based on the previous census enumeration done in 2019. \n\n### Content\n\nThe first row contains the total numbers for the whole country. i.e the row with \"kenya\" entry under County column. The dataset has 42 columns representing the county and corresponding number of household involved in production of that crop.\n\n\n### Acknowledgements\n\nAfrica's Largest Volunteer Driven Open Data Platform OpenAFRICA aims to be the largest independent repository of open data on the African continent. Also the open data portal in Kenya [http://www.opendata.go.ke/](http://www.opendata.go.ke/) gave out quite some insight\n\n\n### Inspiration\n\nWhat questions do you want to see answered?\n\n- Showcase the impact of data science in agricultural resource planning\n- Explolatory Data Analysis of the current crop production distribution\n- Formulaion of strategic food reserve policies based on field data\nAny other purpose of course",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 2198,
    "num_entries": 16506,
    "row_count": 393,
    "source": "kaggle",
    "tags": [
        "arts and entertainment",
        "business",
        "agriculture"
    ],
    "title": "Distirbution of crop production Kenya 2019 census",
    "topic": "agriculture",
    "url": "kaggle.com/datasets/osiroski/distirbution-of-crop-production-kenya-2019-census",
    "usability": 0.9411764705882353
}