{
    "col_count": 24,
    "col_names": [
        "Country",
        "farms_number",
        "used_agricultural_area_ha",
        "standard_output_EUR",
        "subsistence_semisubsistence_farms",
        "total_labour_persons",
        "total_labour_AWU",
        "nonfamily_labour_persons",
        "nonfamily_labour_AWU",
        "managers_basic_training",
        "managers_only_practical",
        "managers_full_training",
        "managers_training_NA",
        "farms_SO_zero",
        "farms_SO_less2000",
        "farms_SO_2000-3999",
        "farms_SO_4000-7999",
        "farms_SO_8000-14999",
        "farms_SO_15000-24999",
        "farms_SO_25000-49999",
        "farms_SO_50000-99999",
        "farms_SO_100000-249999",
        "farms_SO_250000-499999",
        "farms_SO_500000_orover"
    ],
    "description": "**### Context**\nThe dataset is used to explore and visualize the differences between the Agricultural Sectors across European countries. While the Common Agricultural Policy is using a set of priorities and financial mechanisms more or less standardized across EU member states, there are huge differences between the West and the East of Europe in terms of their agricultural sectors. Romania is a particular interesting case, having one of the most fragmented and least productive agricultural sector. \n\n**### Content**\nThe database contains a selection of Farm Structure Indicators for EU member states (28 countries, including UK). The selected indicators provide an overview of the European Agricultural sector (for a non-expert public) and allow for relevant comparisons between EU countries.\nData covers the year 2016, the most recent year for which Farm Structure data was provided by Eurostat. Since multiple countries conducted their Agricultural Census in the period 2020-2021, more recent data is expected to be published soon.\n\nThe indicators were selected and downloaded from the Eurostat database. The indicators come from 4 different Eurostat data tables: [ef_m_farmleg], [ef_lf_main], [ef_mp_training], [ef_m_farmang]. Given the different structure of the datasets provided by Eurostat, the indicators were merged into the final database using a series of VLOOKUP functions in Microsoft Excel.\n\n### Inspiration\nI will be using the data to produce a series of maps (in leaflet() or tmap() in R), exploring cross country differences and trying to answer questions about how \"common\" really is the European Agriculture.\n",
    "licenses": [
        {
            "hasName": true,
            "name": "EU ODP Legal Notice",
            "nameNullable": "EU ODP Legal Notice"
        }
    ],
    "null_count": 28,
    "num_entries": 672,
    "row_count": 28,
    "source": "kaggle",
    "tags": [
        "europe",
        "business",
        "agriculture"
    ],
    "title": "European Agriculture Indicators",
    "topic": "agriculture",
    "usability": 1.0
}