{
    "col_count": 23,
    "col_names": [
        "Attack ID",
        "Country",
        "Attack Date",
        "Attack Time",
        "Certainty Level",
        "Attack Type",
        "Total Injured",
        "Total Death",
        "HC Facilities",
        "HC Transport",
        "HC Personnel",
        "HC Supplies Assets",
        "HC Warehouse Storage",
        "HC Patients",
        "HC Other",
        "Type of Facility",
        "Facility Other",
        "HW Abduction",
        "HW Arrest",
        "HW Detention",
        "Patient Abduction",
        "Patient Arrest",
        "Patient Detention"
    ],
    "description": "# SURVEILLANCE SYSTEM FOR ATTACKS ON HEALTH CARE (SSA)\n\n\nThe Surveillance System for Attacks on Health Care (SSA) is one of the primary outputs of this initiative. Advocacy against attacks on health care, and providing evidence on the effectiveness of practices to minimize attacks and mitigate the consequences of attacks are the two initiatives of the surveillance system.\n\n<img src=\"https://i.postimg.cc/MZcpVscF/68579908-10156532935817263-108539389847535616-o.jpg\" style=\"border-radius: 10px\">\n\nThe SSA is supposed to systematically collect data on attacks on health care, and produce and release the report online immediately after the event. This surveillance system would facilitate accountability through global health governance, improve the visibility of the SSA within WHO and throughout the UN, analyse data to support engagement with perpetrators, and strengthen the SSA as an effective mechanism to safeguard health and human rights. However, the incompetence of WHO in fulfilling its mandate on the issue potentially undermines efforts to engage with those who attack health-care facilities, and weakens efforts to prevent future attacks.",
    "licenses": [
        {
            "hasName": true,
            "name": "ODC Public Domain Dedication and Licence (PDDL)",
            "nameNullable": "ODC Public Domain Dedication and Licence (PDDL)"
        }
    ],
    "null_count": 8584,
    "num_entries": 84847,
    "row_count": 3689,
    "source": "kaggle",
    "tags": [
        "healthcare",
        "tabular",
        "public safety",
        "social issues and advocacy",
        "human rights",
        "hospitals and treatment centers"
    ],
    "title": "Attacks Against Health Workers Around the World",
    "topic": "health",
    "url": "kaggle.com/datasets/abdullahsangha/attacks-against-health-workers-around-the-world",
    "usability": 1.0
}