{
    "col_count": 19,
    "col_names": [
        "Year",
        "Laureate_Id",
        "Firstname",
        "Lastname",
        "Category",
        "Gender",
        "Prize_Share",
        "Motivation",
        "Birth_Date",
        "Birth_Country",
        "Birth_City",
        "Birth_Country_Code",
        "Death_Date",
        "Death_Country",
        "Death_City",
        "Death_Country_Code",
        "Organization_Name",
        "Organization_City",
        "Organization_Country"
    ],
    "description": "# Introduction:\nThe Nobel Prize is one of the most prestigious international honors awarded annually in recognition of outstanding achievements in various fields. Established in 1895 by the will of Alfred Nobel, a Swedish inventor, engineer, and industrialist, the Nobel Prize celebrates individuals and organizations that have made remarkable contributions to humanity in six categories: Physics, Chemistry, Physiology or Medicine, Literature, Peace, and Economic Sciences.\n\nThe prizes are bestowed based on the recommendations of expert committees and organizations specific to each category. The Nobel Prizes have become a symbol of excellence and innovation, encouraging groundbreaking discoveries, literary excellence, peaceful diplomacy, and economic advancements.\n\nThe laureates, from diverse backgrounds and disciplines, have shaped our world and improved the lives of countless individuals through their remarkable accomplishments. The Nobel Prize continues to inspire and recognize those who strive to make significant positive impacts on society and contribute to the advancement of knowledge and human welfare.\n\n# Content:\nThis dataset includes records of all the Nobel Laureates (Individuals or Organizations) awarded till date.\n\n# Acknowledgements:\nThis dataset was acquired from the **Nobel Prize API**.\nFor further information, follow the link: [https://www.nobelprize.org/about/developer-zone-2/]\n\n\n# Licences:\nThis Dataset is free to use according to the **Creative Commons Zero (CC0) license**.\nFor further information follow the link: [https://www.nobelprize.org/about/terms-of-use-for-api-nobelprize-org-and-data-nobelprize-org/]",
    "licenses": [
        {
            "hasName": true,
            "name": "other",
            "nameNullable": "other"
        }
    ],
    "null_count": 1956,
    "num_entries": 18791,
    "row_count": 989,
    "source": "kaggle",
    "tags": [
        "education",
        "exploratory data analysis",
        "pandas",
        "seaborn",
        "data storytelling"
    ],
    "title": "All Nobel Laureates 1901-present",
    "topic": "chemistry",
    "url": "kaggle.com/datasets/prithusharma1/all-nobel-laureates-1901-present",
    "usability": 1.0
}