{
    "col_count": 7,
    "col_names": [
        "date",
        "open_price",
        "high_price",
        "low_price",
        "close_price",
        "volume",
        "adjclose_price"
    ],
    "description": "GameStop Corp. is an American video game, consumer electronics, and gaming merchandise retailer. GameStop's stocks have spiked in recent days since the Reddit group blew up the stock price. Now GameStop is up more than 1,700% since the start of January. so it is interesting to try to predict the stock prices in the next months and see how prediction and time series models will perform in this case. This  Dataset is a daily historical stock price of GameStop from February 2002 (the year it was listed) to January 2021. \n\n### Content\n\nThe dataset contains:\n\n1.  Date: The date of trading\n2. Open_price: The opening price of the stock\n3. High_price: The high price of that day \n4. Low_price: The low price of that day\n5. Close_price: The closed price of that day \n6. Volume: The amount of stocks traded during that day\n7. Adjclose_price: The stock's closing price has been amended to include any distributions/corporate actions that occur before the next days open.\n\n### Acknowledgements\n\nThis Dataset collected from Yahoo finance website\n\n### Inspiration\n\nHow a sudden increasi in the volume affect stock trading? \nWhat the impact of the variance between the adjusted close and the next day's opening price?",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 0,
    "num_entries": 33411,
    "row_count": 4773,
    "source": "kaggle",
    "tags": [
        "video games",
        "business",
        "finance",
        "economics",
        "time series analysis",
        "retail and shopping",
        "investing"
    ],
    "title": "GameStop Historical Stock Prices ",
    "topic": "finance",
    "url": "kaggle.com/datasets/hananxx/gamestop-historical-stock-prices",
    "usability": 1.0
}