{
    "col_count": 81,
    "col_names": [
        "Date",
        "Open",
        "High",
        "Low",
        "Close",
        "Adj Close",
        "Volume",
        "SP_open",
        "SP_high",
        "SP_low",
        "SP_close",
        "SP_Ajclose",
        "SP_volume",
        "DJ_open",
        "DJ_high",
        "DJ_low",
        "DJ_close",
        "DJ_Ajclose",
        "DJ_volume",
        "EG_open",
        "EG_high",
        "EG_low",
        "EG_close",
        "EG_Ajclose",
        "EG_volume",
        "EU_Price",
        "EU_open",
        "EU_high",
        "EU_low",
        "EU_Trend",
        "OF_Price",
        "OF_Open",
        "OF_High",
        "OF_Low",
        "OF_Volume",
        "OF_Trend",
        "OS_Price",
        "OS_Open",
        "OS_High",
        "OS_Low",
        "OS_Trend",
        "SF_Price",
        "SF_Open",
        "SF_High",
        "SF_Low",
        "SF_Volume",
        "SF_Trend",
        "USB_Price",
        "USB_Open",
        "USB_High",
        "USB_Low",
        "USB_Trend",
        "PLT_Price",
        "PLT_Open",
        "PLT_High",
        "PLT_Low",
        "PLT_Trend",
        "PLD_Price",
        "PLD_Open",
        "PLD_High",
        "PLD_Low",
        "PLD_Trend",
        "RHO_PRICE",
        "USDI_Price",
        "USDI_Open",
        "USDI_High",
        "USDI_Low",
        "USDI_Volume",
        "USDI_Trend",
        "GDX_Open",
        "GDX_High",
        "GDX_Low",
        "GDX_Close",
        "GDX_Adj Close",
        "GDX_Volume",
        "USO_Open",
        "USO_High",
        "USO_Low",
        "USO_Close",
        "USO_Adj Close",
        "USO_Volume"
    ],
    "description": "### Context\n\nHistorically, gold had been used as a form of currency in various parts of the world including the USA. In present times, precious metals like gold are held with central banks of all countries to guarantee re-payment of foreign debts, and also to control inflation which results in reflecting the financial strength of the country. Recently, emerging world economies, such as China, Russia, and India have been big buyers of gold, whereas the USA, SoUSA, South Africa, and Australia are among the big seller of gold.\n\nForecasting rise and fall in the daily gold rates can help investors to decide when to buy (or sell) the commodity. But Gold prices are dependent on many factors such as prices of other precious metals, prices of crude oil, stock exchange performance, Bonds prices, currency exchange rates, etc.\n\nThe challenge of this project is to accurately predict the future adjusted closing price of Gold ETF across a given period of time in the future. The problem is a regression problem, because the output value which is the adjusted closing price in this project is continuous value.\n\n### Content\n\nData for this study is collected from November 18th 2011 to January 1st 2019 from various sources. The data has 1718 rows in total and 80 columns in total. Data for attributes, such as Oil Price, Standard and Poor’s (S&P) 500 index, Dow Jones Index US Bond rates (10 years), Euro USD exchange rates, prices of precious metals Silver and Platinum and other metals such as Palladium and Rhodium, prices of US Dollar Index, Eldorado Gold Corporation and Gold Miners ETF were gathered.\n\nThe dataset has 1718 rows in total and 80 columns in total. Data for attributes, such as Oil Price, Standard and Poor’s (S&P) 500 index, Dow Jones Index US Bond rates (10 years), Euro USD exchange rates, prices of precious metals Silver and Platinum and other metals such as Palladium and Rhodium, prices of US Dollar Index, Eldorado Gold Corporation and Gold Miners ETF were gathered.\n\nThe historical data of Gold ETF fetched from Yahoo finance has 7 columns, Date, Open, High, Low, Close, Adjusted Close, and Volume, the difference between Adjusted Close and Close is that the closing price of a stock is the price of that stock at the close of the trading day. Whereas the adjusted closing price takes into account factors such as dividends, stock splits, and new stock offerings to determine a value. So, Adjusted Close is the outcome variable which is the value you have to predict.\n\n![](https://i.ibb.co/C29bbXf/snapshot.png)\n\n### Acknowledgements\n\nThe data is collected from Yahoo finance.\n\n\n### Inspiration\n\nCan you predict Gold prices accurately using traditional machine learning algorithms",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 0,
    "num_entries": 139158,
    "row_count": 1718,
    "source": "kaggle",
    "tags": [
        "finance",
        "economics",
        "beginner",
        "tabular",
        "regression"
    ],
    "title": "Gold Price Prediction Dataset",
    "topic": "finance",
    "url": "kaggle.com/datasets/sid321axn/gold-price-prediction-dataset",
    "usability": 0.9411764705882353
}