{
    "col_count": 15,
    "col_names": [
        "Index Number ",
        "Rank",
        "Country/Economy",
        "GDP (millions of $)",
        "Agriculture GDP",
        "Unnamed: 5",
        "Unnamed: 6",
        "Industry",
        "Unnamed: 8",
        "Unnamed: 9",
        "Services",
        "Unnamed: 11",
        "Unnamed: 12",
        "Year GDP ",
        "Year Sector"
    ],
    "description": "# **CONTENT**\n\nThe figures are based on GDP (Nominal) and sector composition ratios provided by the CIA World Fact Book. Agriculture includes farming, fishing, and forestry. Industry includes mining, manufacturing, energy production, and construction. Services cover government activities, communications, transportation, finance, and all other private economic activities that do not produce material goods.\n\n## **CONTEXT**\n\n- **Agriculture Sector :** Agriculture Sector contributes 6.4 percent of total world's economic production. Total production of sector is $5,084,800 million. China is the largest contributer followed by India. China and India accounts for 19.49 and 7.39 percent of total global agricultural output. World's largest economy United States is at third place. Next in line come Brazil and Indonesia\n\n- **Industry Sector : **With GDP of $23,835 billion, Industry Sector holds a share of 30% of total GDP nominal. China is the largest contributor followed by US. Japan is at 3rd and Germany is at 4th place. These four countries contributes 45.84 of total global industrial output.\n\n- **Services Sector :** Services sector is the largest sector of the world as 63 percent of total global wealth comes from services sector. United States is the largest producer of services sector with around 15.53 trillion USD. Services sector is the leading sector in 201 countries/economies. 30 countries receive more than 80 percent of their GDP from services sector. Chad has lowest 27% contribution by services sector in its economy.\n",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 6,
    "num_entries": 3465,
    "row_count": 231,
    "source": "kaggle",
    "tags": [
        "business",
        "economics",
        "data cleaning",
        "data visualization",
        "data analytics",
        "tabular"
    ],
    "title": "List of Countries by GDP Sector Composition",
    "topic": "finance",
    "url": "kaggle.com/datasets/rajkumarpandey02/list-of-countries-by-gdp-sector-composition",
    "usability": 1.0
}