{
    "col_count": 10,
    "col_names": [
        "Date",
        "Open",
        "High",
        "Low",
        "Close",
        "Volume",
        "Dividends",
        "Stock Splits",
        "zip",
        "10577"
    ],
    "description": "![Mastercard](https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Mastercard_2019_logo.svg/195px-Mastercard_2019_logo.svg.png)\n\nMastercard Inc. (stylized as MasterCard from 1979 to 2016 and MasterCard since 2016) is an American multinational financial services corporation headquartered in the Mastercard International Global Headquarters in Purchase, New York. The Global Operations Headquarters is located in O'Fallon, Missouri, a municipality of St. Charles County, Missouri. Throughout the world, its principal business is to process payments between the banks of merchants and the card-issuing banks or credit unions of the purchasers who use the \"Mastercard\" brand debit, credit, and prepaid cards to make purchases. Mastercard Worldwide has been a publicly traded company since 2006. Prior to its initial public offering, Mastercard Worldwide was a cooperative owned by the more than 25,000 financial institutions that issue its branded cards.\n\nMastercard, originally known as Interbank from 1966 to 1969 and Master Charge from 1969 to 1979, was created by an alliance of several regional bank card associations in response to the BankAmericard issued by Bank of America, which later became the Visa credit card issued by Visa Inc.\n\n\nMastercard is one of the best performing stocks of the decade of 2011-2020",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 33,
    "num_entries": 31276,
    "row_count": 4022,
    "source": "kaggle",
    "tags": [
        "business",
        "finance",
        "computer science",
        "linear regression",
        "investing"
    ],
    "title": "MasterCard Stock Data - Latest and Updated",
    "topic": "finance",
    "usability": 1.0
}