{
    "col_count": 10,
    "col_names": [
        "Date",
        "Open",
        "High",
        "Low",
        "Close",
        "Volume",
        "Dividends",
        "Stock Splits",
        "Key",
        "Value"
    ],
    "description": "![Palantir Technologies](https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Palantir_Technologies_logo.svg/1024px-Palantir_Technologies_logo.svg.png)\n\nPalantir Technologies is a public American software company that specializes in big data analytics. Headquartered in Denver, Colorado, it was founded by Peter Thiel, Nathan Gettings, Joe Lonsdale, Stephen Cohen, and Alex Karp in 2003. The company's name is derived from The Lord of the Rings where the magical palantíri were \"seeing-stones,\" described as indestructible balls of crystal used for communication and to see events in other parts of the world.\n\nThe company is known for three projects in particular: Palantir Gotham, Palantir Metropolis, and Palantir Foundry. Palantir Gotham is used by counter-terrorism analysts at offices in the United States Intelligence Community (USIC) and United States Department of Defense. In the past, Gotham was used by fraud investigators at the Recovery Accountability and Transparency Board, a former US federal agency which operated from 2009 to 2015. Gotham was also used by cyber analysts at Information Warfare Monitor, a Canadian public-private venture which operated from 2003 to 2012. Palantir Metropolis is used by hedge funds, banks, and financial services firms. Palantir Foundry is used by corporate clients such as Morgan Stanley, Merck KGaA, Airbus, and Fiat Chrysler Automobiles NV.\n\nPalantir's original clients were federal agencies of the USIC. It has since expanded its customer base to serve state and local governments, as well as private companies in the financial and healthcare industries.\n\n# Let us analyze and visualize",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 42,
    "num_entries": 2552,
    "row_count": 433,
    "source": "kaggle",
    "tags": [
        "business",
        "finance",
        "computer science",
        "data cleaning",
        "data analytics",
        "deep learning",
        "investing"
    ],
    "title": "Palantir - Stock Data - Latest and Updated",
    "topic": "finance",
    "url": "kaggle.com/datasets/kalilurrahman/palantir-stock-data-latest-and-updated",
    "usability": 1.0
}