{
    "col_count": 7,
    "col_names": [
        "Date",
        "Open",
        "High",
        "Low",
        "Close",
        "Adj Close",
        "Volume"
    ],
    "description": "The \"Roblox Stock Price Dataset (2021-2023)\" curated by Arslan provides comprehensive daily trading data for Roblox Corporation's stock from its initial public offering (IPO) date on **March 10, 2021, until June 19, 2023.** The dataset was extracted from **Yahoo Finance**, a reputable financial platform.\n\nRoblox Corporation, founded by **David Baszucki** and Erik Cassel, originated from their previous venture, Knowledge Revolution, an educational software company. They established Roblox Corporation in 2004, starting with the development of the game DynaBlocks, later renamed Roblox, and officially released on September 1, 2006. Since then, Roblox has grown to become a prominent player in the gaming industry.\n\nThe dataset contains key stock market indicators such as the opening price, closing price, highest price, lowest price, and trading volume for each trading day. The data is organized chronologically, enabling users to analyze the stock's performance, track trends, and gain insights into Roblox Corporation's market value over the specified period.\n\n**Please note that the dataset includes data until June 19, 2023. Researchers, investors, and analysts can utilize this dataset to perform various quantitative analyses, evaluate investment strategies, and explore the historical performance of Roblox stock.**\nBy leveraging this comprehensive dataset, stakeholders can uncover valuable patterns, trends, and correlations to make informed decisions within the context of the dynamic and evolving Roblox Corporation and the stock market at large.",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 0,
    "num_entries": 4004,
    "row_count": 572,
    "source": "kaggle",
    "tags": [
        "finance",
        "advanced",
        "tabular",
        "investing"
    ],
    "title": "Roblox stock pricing (2021-2023)",
    "topic": "finance",
    "url": "kaggle.com/datasets/arslanr369/roblox-stock-pricing-2021-2023",
    "usability": 1.0
}