{
    "col_count": 13,
    "col_names": [
        "Date",
        "Dividends",
        "Stock Splits",
        "Open",
        "High",
        "Low",
        "Close",
        "Volume",
        "zip",
        "98134"
    ],
    "description": "![](https://upload.wikimedia.org/wikipedia/en/thumb/3/35/Starbucks_Coffee_Logo.svg/240px-Starbucks_Coffee_Logo.svg.png)\n![](https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Lody_marki_Starbucks.jpg/320px-Lody_marki_Starbucks.jpg)\n\n##### Content from Wikipedia\nStarbucks Corporation is an American multinational chain of coffeehouses and roastery reserves headquartered in Seattle, Washington. As the world's largest coffeehouse chain, Starbucks is seen to be the major representation of the United States' second wave of coffee culture. As of September 2020, the company had 32,660 stores in 83 countries, including 16,637 company operated stores and 16,023 licensed stores. Of these 32,660 stores, 18,354 were in the United States, Canada, and Latin America. Starbucks locations serve hot and cold drinks, whole-bean coffee, micro-ground instant coffee, espresso, caffe latte, full and loose-leaf teas, juices, Frappuccino beverages, pastries, and snacks. Some offerings are seasonal or specific to the locality of the store. Depending on the country, most locations offer free Wi-Fi.\n\nHeadquartered in the Starbucks Center, the company was founded in 1971 by Jerry Baldwin, Zev Siegl, and Gordon Bowker at Seattle's Pike Place Market. During the early 1980s, they sold the company to Howard Schultz who – after a business trip to Milan, Italy – decided to make the coffee bean store a coffeeshop serving espresso-based drinks. While chief executive officer from 1986 to 2000, Schultz's first tenure led to an aggressive expansion of the franchise, first in Seattle, then across the West Coast of the United States.",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 39,
    "num_entries": 59432,
    "row_count": 7574,
    "source": "kaggle",
    "tags": [
        "finance",
        "time series analysis",
        "deep learning",
        "retail and shopping",
        "investing"
    ],
    "title": "Starbucks Stock Data - Live and Latest",
    "topic": "finance",
    "url": "kaggle.com/datasets/kalilurrahman/starbucks-stock-data-live-and-latest",
    "usability": 1.0
}