{
    "col_count": 6,
    "col_names": [
        "Symbol",
        "company",
        "company_type",
        "value",
        "year",
        "politician"
    ],
    "description": "### Context\n\n[GovTrades.org](https://govtrades.org) aggregates and cleans data on the financial holdings of elected officials to increase transparency and accountability in policymaking. \n\n\n### Content\n\nThis dataset contains data from annual personal finance disclosures all elected officials in Virginia's Senate and House of Delegates. Elected officials are required to disclose their asset holdings each year. GovTrades has matched assets that are publicly traded to tickers to make it easier to match to financial data. The original data can be found on the Virginia Conflict of Interest and Ethics Advisory Council [website](http://ethicssearch.dls.virginia.gov/#tabs1-conflict). \n\n\n### Inspiration\n\nIn light of abuse of insider knowledge in stock trading by politicians at the federal level (e.g. Senator Barr), we think there may also be abuses of power and conflicts of interest at the state level where there is less oversight. Politicians may have insider knowledge about policy that affects stock prices (In Virginia, this could pertain to large companies headquartered in the state like Altria, Northrop Grumman, and Dollar Tree) or the bills they push for may benefit corporations they own stock in. We welcome the public to investigate and analyze this dataset to help shed light on any ",
    "licenses": [
        {
            "hasName": true,
            "name": "CC-BY-NC-SA-4.0",
            "nameNullable": "CC-BY-NC-SA-4.0"
        }
    ],
    "null_count": 1067,
    "num_entries": 40902,
    "row_count": 6817,
    "source": "kaggle",
    "tags": [
        "finance",
        "government",
        "politics",
        "investing"
    ],
    "title": "Stock Holdings of Elected Officials (Virginia)",
    "topic": "finance",
    "url": "kaggle.com/datasets/govtrades/stock-holdings-of-elected-officials-virginia",
    "usability": 0.9117647058823529
}