{
    "col_count": 7,
    "col_names": [
        "Date",
        "High",
        "Low",
        "Open",
        "Close",
        "Volume",
        "Adj Close"
    ],
    "description": "### Context\n\nStocks and financial instrument trading is a lucrative proposition. Stock markets across the world facilitate such trades and thus wealth exchanges hands. Stock prices move up and down all the time and having ability to predict its movement has immense potential to make one rich.\nStock price prediction has kept people interested from a long time. There are hypothesis like the Efficient Market Hypothesis, which says that it is almost impossible to beat the market consistently and there are others which disagree with it.\n\nThere are a number of known approaches and new research going on to find the magic formula to make you rich. One of the traditional methods is the time series forecasting. Fundamental analysis is another method where numerous performance ratios are analyzed to assess a given stock. On the emerging front, there are neural networks, genetic algorithms, and ensembling techniques. \n\nAnother challenging problem in stock price prediction is **Black Swan Event**,  unpredictable events that cause stock market turbulence. These are events that occur from time to time, are unpredictable and often come with little or no warning. \n\n*A black swan event is an event that is completely unexpected and cannot be predicted. Unexpected events are generally referred to as black swans when they have significant consequences, though an event with few consequences might also be a black swan event. It may or may not be possible to provide explanations for the occurrence after the fact – but not before. In complex systems, like economies, markets and weather systems, there are often several causes. After such an event, many of the explanations for its occurrence will be overly simplistic.*\n\n#  \n#  \n\n <img src=\"https://www.visualcapitalist.com/wp-content/uploads/2020/03/mm3_black_swan_events_shareable.jpg\">\n#  \n#  \nNew bleeding age state-of-the-art  deep learning models stock predictions is overcoming such  obstacles e.g. \"Transformer and Time Embeddings\". An objectives are to apply these novel models to forecast stock price. \n\n\n### Content\n\nStock price prediction is the task of forecasting the future value of a given stock. Given the historical daily close price for S&P 500 Index, prepare and compare forecasting solutions. S&P 500 or Standard and Poor's 500 index is an index comprising of 500 stocks from different sectors of US economy and is an indicator of US equities. Other such indices are the Dow 30, NIFTY 50, Nikkei 225, etc.\nFor the purpose of understanding, we are utilizing S&P500 index, concepts, and knowledge can be applied to other stocks as well.\n\n\n\n### Dataset\nThe historical stock price information is also publicly available. For our current use case, we will utilize the pandas_datareader library to get the required S&P 500 index history using **Yahoo Finance databases**.  We utilize the closing price information from the dataset available though other information such as opening price, adjusted closing price, etc., are also available.\nWe prepare a utility function get_raw_data() to extract required information in a pandas dataframe. The function takes index ticker name as input. For S&P 500 index, the ticker name is ^GSPC. The following snippet uses the utility function to get the required data.(See [Simple LSTM Regression](https://www.kaggle.com/arashnic/simple-lstm-regression))\n\n**Features and Terminology:**\nIn stock trading, the high and low refer to the maximum and minimum prices in a given time period. Open and close are the prices at which a stock began and ended trading in the same period. Volume is the total amount of trading activity. Adjusted values factor in corporate actions such as dividends, stock splits, and new share issuance.\n\n \n\n### Starter Kernel(s)\n- [Simple LSTM Regression](https://www.kaggle.com/arashnic/simple-lstm-regression)\n\n### Acknowledgements\n\nMining and updating of this dateset will depend upon **Yahoo Finance** .\n\n\n### Inspiration\n\nSort of variation of sequence modeling and bleeding age e.g. attention can be applied for research and forecasting\n\n### Some Readings\n- [Applications of deep learning in stock market prediction: recent progress](https://arxiv.org/pdf/2003.01859.pdf)\n- [Stock predictions with state-of-the-art Transformer and Time Embeddings](https://towardsdatascience.com/stock-predictions-with-state-of-the-art-transformer-and-time-embeddings-3a4485237de6)\n- https://arxiv.org/pdf/1712.02136.pdf\n- https://catanacapital.com/blog/unpredictable-black-swan-event-stock-market/\n- https://par.nsf.gov/servlets/purl/10149715\n- https://arxiv.org/pdf/1712.02136.pdf\n\n#  <hr style=\"border: 2px solid gray\"> \n#### *If you download and find the data useful your **upvote** is an explicit feedback for future works*\n",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 0,
    "num_entries": 12775,
    "row_count": 1825,
    "source": "kaggle",
    "tags": [
        "earth and nature",
        "business",
        "computer science",
        "investing"
    ],
    "title": "Time Series Forecasting with Yahoo Stock Price ",
    "topic": "finance",
    "url": "kaggle.com/datasets/arashnic/time-series-forecasting-with-yahoo-stock-price",
    "usability": 1.0
}