{
    "col_count": 15,
    "col_names": [
        "Team",
        "League",
        "Year",
        "RS",
        "RA",
        "W",
        "OBP",
        "SLG",
        "BA",
        "Playoffs",
        "RankSeason",
        "RankPlayoffs",
        "G",
        "OOBP",
        "OSLG"
    ],
    "description": "### Context\n\nIn the early 2000s, Billy Beane and Paul DePodesta worked for the Oakland Athletics. While there, they literally changed the game of baseball. They didn't do it using a bat or glove, and they certainly didn't do it by throwing money at the issue; in fact, money was the issue. They didn't have enough of it, but they were still expected to keep up with teams that had much deeper pockets. This is where Statistics came riding down the hillside on a white horse to save the day. This data set contains some of the information that was available to Beane and DePodesta in the early 2000s, and it can be used to better understand their methods.\n\n\n### Content\n\nThis data set contains a set of variables that Beane and DePodesta focused heavily on. They determined that stats like on-base percentage (OBP) and slugging percentage (SLG) were very important when it came to scoring runs, however they were largely undervalued by most scouts at the time. This translated to a gold mine for Beane and DePodesta. Since these players weren't being looked at by other teams, they could recruit these players on a small budget. The variables are as follows:\n\n- Team\n- League\n- Year\n- Runs Scored (RS)\n- Runs Allowed (RA)\n- Wins (W)\n- On-Base Percentage (OBP)\n- Slugging Percentage (SLG)\n- Batting Average (BA)\n- Playoffs (binary)\n- RankSeason\n- RankPlayoffs\n- Games Played (G)\n- Opponent On-Base Percentage (OOBP)\n- Opponent Slugging Percentage (OSLG)\n\n### Acknowledgements\n\nThis data set is referenced in The Analytics Edge course on EdX during the lecture regarding the story of Moneyball.\nThe data itself is gathered from baseball-reference.com.\nSports-reference.com is one of the most comprehensive sports statistics resource available, and I highly recommend checking it out.\n\n\n### Inspiration\n\nIt is such an important skill in today's world to be able to see the \"truth\" in a data set. That is what DePodesta was able to do with this data, and it unsettled the entire system of baseball recruitment. Beane and DePodesta defined their season goal as making it to playoffs. With that in mind, consider these questions:\n\n- How does a team make the playoffs?\n- How does a team win more games?\n- How does a team score more runs?\n\nThey are all simple questions with simple answers, but now it is time to use the data to find the \"truth\" hidden in the numbers.",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 3600,
    "num_entries": 18480,
    "row_count": 1232,
    "source": "kaggle",
    "tags": [
        "baseball"
    ],
    "title": "Moneyball",
    "topic": "sports",
    "url": "kaggle.com/datasets/wduckett/moneyball-mlb-stats-19622012",
    "usability": 0.8235294117647058
}