{
    "col_count": 32,
    "col_names": [
        "season",
        "date",
        "away.team",
        "away.score",
        "home.team",
        "home.score",
        "line",
        "over_under"
    ],
    "description": "### Context\n\nAfter participating in many Kaggle competitions, we decided to open-source our Python AutoML framework [AlphaPy][1]. You can configure models using YAML, and it's a quick way to develop a classification or regression model with any number of [scikit-learn][2] algorithms. More importantly, we needed the ability to easily write custom transformations to engineer features that could be imported by other tools such as [H2O.ai][3] and [DataRobot][4], which are commercial AutoML tools.\n\nWe were very interested in predicting the stock market and sporting events, so we developed some tools for collecting end-of-day stock market data and then transforming that time series data for machine learning. For the sports data, we painstakingly entered game results on a daily basis, and this dataset (albeit limited) is the result. Sports APIs such as [Sportradar][5] are becoming more prevalent, but you still need a pipeline to merge all that data to shape it for machine learning.\n\n### Content\n\nWe collected game results, line, and over/under data for the following sports and seasons:\n\n - NFL 2014, 2015 (2 Seasons)\n - NBA 2015-16 (1 Season)\n - NCAA Football 2015-16 (1 Season)\n - NCAA Basketball 2015-16 (1 Season)\n\nUsing AlphaPy, we developed a sports pipeline to analyze trend data in the game results. You can find [documentation][6] and examples [here][7].\n\n\n### Inspiration\n\nEvery speculator's dream is to gain an edge, whether it be betting on sports or speculating on stocks. This dataset is just a small step for applying machine learning to the world of sports data.\n\n[1]: https://github.com/ScottFreeLLC/AlphaPy\n[2]: http://scikit-learn.org/stable/\n[3]: https://www.h2o.ai/\n[4]: https://www.datarobot.com/\n[5]: https://developer.sportradar.com/\n[6]: http://alphapy.readthedocs.io/en/latest/\n[7]: http://alphapy.readthedocs.io/en/latest/tutorials/ncaab.html",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 0,
    "num_entries": 53216,
    "row_count": 6652,
    "source": "kaggle",
    "tags": [
        "basketball",
        "sports",
        "computer science",
        "gambling"
    ],
    "title": "Pro and College Sports Lines",
    "topic": "sports",
    "url": "kaggle.com/datasets/scottfree/sports-lines",
    "usability": 0.6470588235294118
}