{
    "col_count": 14,
    "col_names": [
        "date",
        "province_thai",
        "province_eng",
        "region_thai",
        "region_eng",
        "variable",
        "value"
    ],
    "description": "📢**April 18, 2023 Update ( Please use Version 2):**\n- Renamed \"profit\" to \"revenue\" for better understanding.\n- Normalized the values in Thai Baht (previously MTHB).\n\n---\n\nThis dataset contains statistics on domestic tourism in Thailand from Jan 2019 to Feb 2023, broken down by province. The dataset includes information on the number of tourists, the occupancy rate, and the profits generated by tourism in each province, as well as the nationality of the tourists (Thai vs. foreign). \n\nSourced from raw data provided by the [Official Ministry of Tourism and Sports Statistics](https://www.mots.go.th/news/category/411), which was manually entered into Excel files 🙃. So I pre-processed the data using Python with the intention of making it more accessible in the appropriate format which has the potential to provide valuable insights into the domestic tourism industry in Thailand, including trends and patterns across different provinces over time. Researchers, analysts, and policymakers with an interest in the domestic tourism sector in Thailand may find this dataset useful for their work.\n\n**Banner credit**: Tourism Authority of Thailand. \n\n&gt; **Cleaned and ready-to-use** 77 Provinces, 8 Variables, 3 Years and 2 Months with total 30,800 rows.\n\n\n\n|Column\t|Description|\n| ---         | --- |\n|date\t|The month and year in which the statistics were recorded. The dataset covers the years 2019-2023.|\n|province_thai\t|The name of the province in Thailand, in the Thai language.|\n|province_eng\t|The name of the province in Thailand, in English.|\n|region_thai\t|The name of the region in Thailand to which the province belongs, in the Thai language.|\n|region_eng\t|The name of the region in Thailand to which the province belongs, in English.|\n|variable\t|The 8 type of data being recorded, such as the number of tourists or the occupancy rate.\n| |`no_tourist_all` The total number of domestic tourists who visited the province \n| | `no_tourist_foreign` The number of foreign tourists who visited the province \n| | `no_tourist_occupied` The total number of occupied hotel rooms in the province \n| | `no_tourist_thai` The number of Thai tourists who visited the province\n| |`occupancy_rate` The percentage of occupied travel accommodation in the province\n| | `revenue_all` The revenue generated by the tourism industry in the province, in Thai Baht\n|| `revenue_foreign` The revenue generated by foreign tourists in the province, in Thai Baht\n|| `revenue_thai`  The revenue generated by Thai tourists in the province, in Thai Baht|\n|value\t|The value of the data being recorded.|\n\n",
    "licenses": [
        {
            "hasName": true,
            "name": "Attribution 4.0 International (CC BY 4.0)",
            "nameNullable": "Attribution 4.0 International (CC BY 4.0)"
        }
    ],
    "null_count": 0,
    "num_entries": 431200,
    "row_count": 61600,
    "source": "kaggle",
    "tags": [
        "time series analysis",
        "tabular",
        "regression",
        "travel",
        "english",
        "thai"
    ],
    "title": "Thailand Domestic Tourism Statistics",
    "topic": "sports",
    "url": "kaggle.com/datasets/thaweewatboy/thailand-domestic-tourism-statistics",
    "usability": 1.0
}