{
    "col_count": 26,
    "col_names": [
        "Player name ",
        "Nation",
        "Position",
        "Squad",
        "Compition",
        "Age",
        "Born year",
        "Match played",
        "Starts",
        "MIn",
        "90s",
        "Goal",
        "Assist",
        "Goal + Assist",
        "Goal+Penalty kick",
        "Penalty Kick",
        "Penalty Kick Attempted",
        "Yellow Card",
        "Red Card",
        "Expected Goal",
        "Non-penalty Expected Goal",
        "Expected Assisted Goal",
        "Non-penalty Expected Goal + Expected Assisted Goal",
        "Progressive Carries",
        "Progressive Passes",
        "Progressive Passes Receive"
    ],
    "description": "The dataset contains player statistics for the 2022-2023 season of the top five football leagues in Europe: **Bundesliga**, **Laliga**, **Ligue 1**, **Premier League**, and **Seria 1** . The data includes various performance metrics for individual players, such as goals, assists, shots on target, successful passes, interceptions, and fouls.\n\n**Bundesliga** is a professional association football league in Germany. At the top of the German football league system, the Bundesliga is Germany's primary football competition. The Bundesliga comprises 18 teams and operates on a system of promotion and relegation with the\n\n**Laliga**  is a private sports association composed of the 20 clubs and SADs (public limited sports companies) in LaLiga Santander and the 22 in LaLiga SmartBank, responsible for the organisation of these national professional football competitions.\n**Serie A** is regarded as one of the best football leagues in the world and it is often depicted as the most tactical and defensively sound national league.\n\n**Ligue 1** officially known as Ligue 1 Uber Eats for sponsorship reasons, is a French professional league for men's association football clubs. At the top of the French football league system, it is the country's primary football competition.\n**The Premier League** (legal name: The Football Association Premier League Limited) is the highest level of the men's English football league system. Contested by 20 clubs, it operates on a system of promotion and relegation with the English Football League (EFL).\n\nThe dataset provides a comprehensive overview of the performance of top football players across Europe in the current season. The data can be used to analyze player performance and identify trends and patterns in the performance of individual players and teams.\n\nThe dataset is suitable for sports analysts, researchers, and enthusiasts who are interested in football and want to explore the performance of top players across the European leagues. It can be used for various purposes, such as player scouting, team analysis, and performance comparison.",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 6059,
    "num_entries": 71994,
    "row_count": 2769,
    "source": "kaggle",
    "tags": [
        "football",
        "global",
        "beginner",
        "intermediate",
        "data analytics"
    ],
    "title": "2022-2023 Top 5 Football Leagues Player Stats",
    "topic": "sports",
    "url": "kaggle.com/datasets/joyshil0599/2022-2023-top-5-football-leagues-player-stats",
    "usability": 0.9411764705882353
}