{
    "col_count": 15,
    "col_names": [
        "Unnamed: 0",
        "name",
        "gender",
        "age",
        "height",
        "nationality",
        "weight",
        "sports",
        "hours_per_day",
        "strength",
        "agility",
        "mental",
        "federation",
        "year_start",
        "rank"
    ],
    "description": "## Context\n\nA **big wrestling tournament** 🏆 was held this year. The 500 best athletes from three different federations across the globe joined us to compete in one-on-one matches. The pools were made randomly no matter the profile of the athlete.  At the end of the tournament, the wrestlers can be ranked according to their number of victories. \n\nWrestling 🤼 is a hand-to-hand combat system and a set of combat sports involving grappling-type techniques such as clinch fighting, throws and takedowns, joint locks, pins and other grappling holds. Wrestling techniques have been incorporated into martial arts, combat sports and military systems.\n\n## Content\n\nIn this Dataset, we have information on the different wrestlers such as their gender, weight, height, nationality, but also different scores to measure their strength, agility and mental abilities. More to be added.\n\n## Inspiration\n\nThis dataset is ideal for regression trying to predict the final rank of the wrestler for example.\nClassification can also be performed to predict for example the federation, the country, or the sports the wrestler master or clustering between the different wrestlers.\n\nRemember to upvote if you found the dataset useful 🥇 \n\n## Dataset Glossary (Column-Wise)\n\n- **name**: Name of the wrestler.\n- **gender**: Gender of the wrestler.\n- **age**: Age of the wrestler.\n- **height**: Height of the wrestler in cm.\n- **weight**: Weight of the wrestler in kg.\n- **nationality**: Nationality of the wrestler.\n- **sports**: The combat sports mastered by the wrestler.\n- **hours\\_per\\_day**: The number of hours spent a day to work out and practice.\n- **strength**: A strength score given by the federation. Varies between 0 and 10.\n- **agility**: An agility score given by the federation. Varies between 0 and 10.\n- **mental**: A mental score given by the federation. Varies between 0 and 10.\n- **federation**: The federation the wrestler is registered in.\n- **year_start**: The year the wrestler started practicing the sport.\n- **rank**: The final rank obtained by the wrestler after the tournament.\n## Acknowledgement\n\n*This is a fictional dataset generated from a simulation in Python.* All the wrestlers are fictional so are their informations and rank. I will post a notebook explaining how I generated this dataset soon.\n\nDon't forget to upvote 👍 if you like the dataset!\n\n",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 0,
    "num_entries": 7500,
    "row_count": 500,
    "source": "kaggle",
    "tags": [
        "sports",
        "classification",
        "clustering",
        "regression"
    ],
    "title": "Wrestling World Tournament",
    "topic": "sports",
    "url": "kaggle.com/datasets/julienjta/wrestling-world-tournament",
    "usability": 1.0
}