{
    "col_count": 30,
    "col_names": [
        "location",
        "date",
        "b3001",
        "b3002",
        "b3003",
        "b3004",
        "b3005",
        "b3006",
        "b3007",
        "b3008",
        "b3009",
        "b3010",
        "b3011",
        "b3012",
        "b3013"
    ],
    "description": "### Content\n\nThe dataset was created using the RSSI readings of an array of 13 ibeacons in the first floor of Waldo Library, Western Michigan University. Data was collected using iPhone 6S. The dataset contains two sub-datasets: a labeled dataset (1420 instances) and an unlabeled dataset (5191 instances). The recording was performed during the operational hours of the library. For the labeled dataset, the input data contains the location (label column), a timestamp, followed by RSSI readings of 13 iBeacons. RSSI measurements are negative values. Bigger RSSI values indicate closer proximity to a given iBeacon (e.g., RSSI of -65 represent a closer distance to a given iBeacon compared to RSSI of -85). For out-of-range iBeacons, the RSSI is indicated by -200. The locations related to RSSI readings are combined in one column consisting a letter for the column and a number for the row of the position. The following figure depicts the layout of the iBeacons as well as the arrange of locations. \n\n![iBeacons Layout](https://www.kaggle.com/mehdimka/ble-rssi-dataset/downloads/iBeacon_Layout.jpg)\n\n### Attribute Information\n\n - location: The location of receiving RSSIs from ibeacons b3001 to b3013; symbolic values showing the column and row of the location on the map (e.g., A01 stands for column A, row 1). \n - date: Datetime in the format of ‘d-m-yyyy hh:mm:ss’\n - b3001 - b3013: RSSI readings corresponding to the iBeacons; numeric, integers only.\n\n### Acknowledgements\nProvider:\nMehdi Mohammadi and Ala Al-Fuqaha, {mehdi.mohammadi, ala-alfuqaha}@wmich.edu,\nDepartment of Computer Science,\nWestern Michigan University\n\nCitation Request:\n\nM. Mohammadi, A. Al-Fuqaha, M. Guizani, J. Oh, “Semi-supervised Deep Reinforcement Learning in Support of IoT and Smart City Services,” IEEE Internet of Things Journal, Vol. PP, No. 99, 2017.\n\n### Inspiration\n\n#### How unlabeled data can help for an improved learning system. How a GAN model can synthesizes viable paths based on the little labeled data and larger set of unlabeled data.  ",
    "licenses": [
        {
            "hasName": true,
            "name": "CC-BY-NC-SA-4.0",
            "nameNullable": "CC-BY-NC-SA-4.0"
        }
    ],
    "null_count": 0,
    "num_entries": 99165,
    "row_count": 6611,
    "source": "kaggle",
    "tags": [
        "universities and colleges",
        "internet",
        "multiclass classification"
    ],
    "title": "BLE RSSI Dataset for Indoor localization",
    "topic": "energy",
    "url": "kaggle.com/datasets/mehdimka/ble-rssi-dataset",
    "usability": 0.8235294117647058
}