{
    "col_count": 6,
    "col_names": [
        "CountryShort",
        "CountryLong",
        "Year",
        "ValueNumeric",
        "Unit",
        "Data_source"
    ],
    "description": "## Description\nElectricity generation gives rise to negative impacts on the environment and human health throughout all stages of its life-cycle. To date, power generation remains the largest GHG-emitting sector in Europe. Carbon dioxide (CO2) is by far the most commonly-emitted GHG across the sector, being a product of combustion processes. An almost complete decarbonisation of the EU’s electricity sector is needed in order to meet the EU’s objective of becoming the first carbon-neutral continent by 2050. Electricity can play an increasing role in decarbonising energy use across a number of sectors, such as transport, industry and households. Information about the carbon intensity of electricity generation is therefore relevant for many stakeholders. The EEA and its European Topic Centre for Climate Change Mitigation and Energy (ETC/CME) produce each year country- and EU-level data on the average annual CO2 emission intensity of electricity generation.\n\nIdentifier\nDAT-232-en\nLanding Page\nhttps://www.eea.europa.eu/data-and-maps/data/co2-intensity-of-electricity-generation \n\n## Release Date\n2020-02-24\n\n## Modified Date\n2020-02-28\n\n## Geographical Coverage\nSlovakia, Slovenia, Sweden, Netherlands, Poland, Portugal, Romania, Belgium, Austria, Cyprus, Bulgaria, Germany, Czechia, Spain, Denmark, Finland, Estonia, United Kingdom, France, Hungary, Greece, Italy, Ireland, Luxembourg, Lithuania, Malta, Latvia\n\n\n## Catalogue\nEuropean Union Open Data Portal\n\n\n## Reference\nURI\nhttp://data.europa.eu/88u/dataset/DAT-232-en",
    "licenses": [
        {
            "hasName": true,
            "name": "EU ODP Legal Notice",
            "nameNullable": "EU ODP Legal Notice"
        }
    ],
    "null_count": 0,
    "num_entries": 5544,
    "row_count": 924,
    "source": "kaggle",
    "tags": [
        "europe",
        "energy"
    ],
    "title": "CO2 Intensity of Electricity Generation",
    "topic": "energy",
    "url": "kaggle.com/datasets/mathchi/co2-intensity-of-electricity-generation",
    "usability": 1.0
}