{
    "col_count": 14,
    "col_names": [
        "date",
        "demand",
        "RRP",
        "demand_pos_RRP",
        "RRP_positive",
        "demand_neg_RRP",
        "RRP_negative",
        "frac_at_neg_RRP",
        "min_temperature",
        "max_temperature",
        "solar_exposure",
        "rainfall",
        "school_day",
        "holiday"
    ],
    "description": "## Content  \nAs of 2020, 6.7 million people reside in Victoria, Australia's second most populated state. Most of them, 5 million, live or work in Melbourne, state's capital. During 2020 Australia was among the first to close international borders, followed by a closure of interstate borders. Victoria introduced some of the strictest pandemic-related restrictions on business activity that resulted in a significant portion of its population working from home.\n\n## Description\nThe dataset covers 2016 days between 1 January 2015 and 6 October 2020. During some intraday intervals RRP was negative, so that energy producers were paying consumers rather than wise versa. Below is a brief description fo the data:\n\n- **date** : datetime, the date of the recording\n- **demand** : float, a total daily electricity demand in MWh\n- **RRP** : float, a recommended retail price in AUD$ / MWh\n- **demand\\_pos\\_RRP** : float, a total daily demand at positive RRP in MWh\n- **RRP\\_positive** : float, an averaged positive RRP, weighted by the corresponding intraday demand in AUD$ / MWh\n- **demand\\_neg\\_RRP** : float, an total daily demand at negative RRP in MWh\n- **RRP\\_negative** : float, an average negative RRP, weighted by the corresponding intraday demand in AUD$ / MWh\n- **frac\\_at\\_neg\\_RRP** : float, a fraction of the day when the demand was traded at negative RRP\n- **min_temperature** : float, minimum temperature during the day in Celsius\n- **max_temperature** : float, maximum temperature during the day in Celsius\n- **solar_exposure** : float, total daily sunlight energy in MJ/m^2\n- **rainfall** : float, daily rainfall in mm\n- **school_day** : boolean, if students were at school on that day\n- **holiday** : boolean, if the day was a state or national holiday",
    "licenses": [
        {
            "hasName": true,
            "name": "DbCL-1.0",
            "nameNullable": "DbCL-1.0"
        }
    ],
    "null_count": 4,
    "num_entries": 29484,
    "row_count": 2106,
    "source": "kaggle",
    "tags": [
        "business",
        "energy",
        "time series analysis",
        "electricity"
    ],
    "title": "Daily Electricity Price and Demand Data",
    "topic": "energy",
    "url": "kaggle.com/datasets/aramacus/electricity-demand-in-victoria-australia",
    "usability": 1.0
}