{
    "col_count": 10,
    "col_names": [
        "timestamp",
        "000D6F00036BB04C",
        "000D6F00029C2BD7",
        "000D6F000353AC8C",
        "000D6F0003562E10",
        "000D6F0003562C48",
        "000D6F00029C2984",
        "000D6F000353AE51",
        "000D6F0003562C0F",
        "000D6F0003562BF6"
    ],
    "description": "![GREEND ENergy Dataset][1]\n\nThe measurement campaign was an ambitious aspect of the MONERGY project in which we monitored active power (Watts) at 1 Hz in selected households in the region of Carinthia (Austria) and Friuli-Venezia Giulia (Italy) for long term (1 year). We have been monitoring 8 households: 4 across the province of Udine (Italy) and 4 in the area of Klagenfurt (Austria). \n\nThe dataset was analyzed to model the energy demand in the regions and released to the research community for further studies. Each household is a different folder containing daily CSV files. Each file has the format timestamp, power for MAC1, power for MAC2, and so on, with MAC indicating in the header the network address of the Zigbee node used to collect the measurements.\n\nIn particular, the dataset was used for the following research areas:\n\n 1. Load disaggregation: identifying individual devices given an overall power measurement\n\n 2. Device usage modelling: predicting device operation in order to model users' preferences and plan control strategies\n\n 3. Occupancy modeling: given device usage inferring room and building occupancy, for instance to control thermostats\n\n 4. Autonomous device operation: learning controllers for small energy consumers/producers given power profiles and usage models extracted from real devices\n\nMore information at the following links:\n\n 1. [https://sourceforge.net/projects/greend/][2] (for downloading the full dataset)\n 2. [http://monergy-project.eu/][3] (for information on the project)\n\nIf you rely on the GREEND dataset or our findings for your research please cite this work:\n\n - A. Monacchi, D. Egarter, W. Elmenreich, S. D’Alessandro, A. M. Tonello. GREEND: An Energy Consumption Dataset of Households in Italy and Austria. In proceedings of the 5th IEEE International Conference on Smart Grid Communications (SmartGridComm 14). 3-6 November 2014, Venice, Italy.\n\n\n  [1]: http://www.monergy-project.eu/wp-content/uploads/2013/11/greend_logo.png\n  [2]: https://sourceforge.net/projects/greend/\n  [3]: http://monergy-project.eu/",
    "licenses": [
        {
            "hasName": true,
            "name": "unknown",
            "nameNullable": "unknown"
        }
    ],
    "null_count": 138725,
    "num_entries": 790050,
    "row_count": 79005,
    "source": "kaggle",
    "tags": [
        "business",
        "economics"
    ],
    "title": "GREEND: GREEND ENergy Dataset",
    "topic": "energy",
    "url": "kaggle.com/datasets/p111110/greend-energy-dataset",
    "usability": 0.5294117647058824
}