{
    "col_count": 27,
    "col_names": [
        "ï»¿index",
        "Where do you live now?",
        "Has anyone in your family or friend circle opted for energy-efficient solutions while renovating their homes?",
        "What is the property in renovation to be used for:",
        "Which type of neighborhood do you live in?",
        "How many members do you live with?",
        "Whatâ\u0080\u0099s the type of house you live in:",
        "Why would you renovate your home if you want to?",
        "Who would you seek guidance from for renovating your home?",
        "What would motivate you to consider energy-efficient renovation solutions?",
        "Which of the following features do you care about most when using a home renovation app?",
        "Under which scenarios will you notice and check a home renovation service?",
        "Why do you prefer to choose a specific home renovation company?",
        "Whatâ\u0080\u0099s your budget for home renovation if you need one?",
        "Would you consider opting for energy-efficient solutions if they cost you slightly more?",
        "How much more are you willing to pay for energy-efficient materials compared to traditional materials?",
        "How much would you like to pay for a consultation service for energy efficiency of your home?",
        "What aspects of home decor / renovation do you value the most?",
        "For  what part of buildings do you think is the most necessary to use new energy materials?",
        "How many new energy materials are used in your current home?",
        "What do you think is the most important to a high energy efficiency building?",
        "Which room or which part do you want to renovate most at present?",
        " How frequently will you consider renovating your home?",
        "What is the duration you expect to renovate?",
        "Do you have knowledge of energy efficiency materials used in home decor/ renovation?",
        "Since you have previous experience or knowledge of energy efficiency materials used in home decor/ renovation, will you still consult professional services on renovation?",
        "Since you do not have knowledge of energy efficiency materials used in home decor/ renovation,How will you decorate/ renovate your home?"
    ],
    "description": "### **Content**\n###### This dataset collects homeowners' opinions on home renovation services, especially energy-efficient ones 🏡\nQuestions include general information, potential reasons for renovation, pricing, design preference, timing, and process of renovation 💡\n\n### **Size of Data**\n###### The final number of respondents got is 41, including people from North America, South America, Europe, and Australia. ",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 0,
    "num_entries": 1107,
    "row_count": 41,
    "source": "kaggle",
    "tags": [
        "europe",
        "north america",
        "australia",
        "renewable energy",
        "tabular"
    ],
    "title": "Home Renovation Data: America, Europe, Australia",
    "topic": "energy",
    "url": "kaggle.com/datasets/yuanmozhu/home-renovation-data-america-europe-australia",
    "usability": 1.0
}