{
    "col_count": 37,
    "col_names": [
        "index",
        "Project ID",
        "Contractor ID",
        "Project County",
        "Project City",
        "Project ZIP",
        "Climate Zone",
        "Weather Station",
        "Weather Station-Normalization",
        "Project Completion Date",
        "Customer Type",
        "Size of Home",
        "Volume of Home",
        "Number of Units",
        "Year Home Built",
        "Total Project Cost ($)",
        "Contractor Incentive ($)",
        "Total Incentives ($)",
        "Amount Financed Through Program ($)",
        "Estimated Annual Electric Savings (kWh)",
        "Estimated Annual Gas Savings (MMBtu)",
        "Estimated First Year Energy Bill Savings ($)",
        "Baseline Electric (kWh)",
        "Baseline Gas (MMBtu)",
        "Reporting Electric (kWh)",
        "Reporting Gas (MMBtu)",
        "Evaluated Annual Electric Savings (kWh)",
        "Evaluated Annual Gas Savings (MMBtu)",
        "Central Hudson",
        "Consolidated Edison",
        "LIPA",
        "National Grid",
        "National Fuel Gas",
        "NYSEG",
        "Orange and Rockland",
        "Rochester Gas and Electric",
        "Location 1"
    ],
    "description": "_____\n# Residential Home Energy Efficiency\n### Evaluated Meter Project Data 2007-2012\nBy State of New York [[source]](https://data.world/stateofny)\n_____\n\n### About this dataset\n> This dataset provides energy efficiency meter evaluated data from 2007-2012 for residential existing homes (one to four units) in New York State. It includes the following data points: Project County, Project City, Project ZIP, Climate Zone, Weather Station, Weather Station-Normalization, Project Completion Date, Customer Type, Size of Home, Volume of Home, Number of Units .Year Home Built , Total Project Cost , Contractor Incentive , Total Incentives , Amount Financed through Program , Estimated Annual Electric Savings (kWh), Estimated Annual Gas Savings (MMBtu), Estimated First Year Energy Bill Savings ($) Baseline Electric (kWh), Baseline Gas (MMBtu), Reporting Electric (kWh), Reporting Gas (MMBtu ),Evaluated Annual Electric Savings( kWh ), Evaluated Annual gas Savings( MMBTU )Central Hudson  LIPA National Fuel gas NYSEG Orange and Rockland Rochester Gas and electric Location 1. This dataset backcasts estimated modeled savings for a subset of 2007 -2012 completed projects in the Home Performance with ENERGY STARprogram against normalized savings calculated by an open source energy efficiency meter. The open source code uses utility grade metered consumption to weather normalize the pre -and post consumption data using standard methods with no discretionary independent variables. It is intended to lay a foundation for future innovation and deployment of the open source energy efficiency meter across the residential energy sector and help inform stakeholders interested in Pay For Performance programs where providers are paid for realizing measurable weather normalized results. Please make sure you read the Disclaimer included before using this data; it contains important information about evaluating savings from contractor reported modeling estimates as well as evaluating Normalized Savigns using Open Source OEE meter\n\n### More Datasets\n> For more datasets, click [here](https://www.kaggle.com/thedevastator/datasets).\n\n### Featured Notebooks\n> - 🚨 **Your notebook can be here!** 🚨! \n\n### How to use the dataset\n> \n> - Last updated information: The last update for this dataset was 2019-11-15\n>  \n> - Data Elements Overview:This dataset includes a variety of data points that provide valuable insights into residential energy efficiency projects undertaken between 2007 TO 2012 in New York State; including project ID, county, city zip code, climate zone, weather station used for normalization methods, completion date customer type size and volume of home number of units year home was built total project cost contractor incentive total incentives amount financed through program etc.  \n>  \n> - Definitions Overview: There are several acronyms included in this datasets such as Central Hudson (a utility company), LIPA (the Long Island Power Authority), National Fuel Gas (National Fuel Gas Utility Company), NYSEG (New York State Electric & Gas Utility Company) and Rochester Gas & Electric (Rochester Gas & Electric Utility Company). Additionally “Climate Zone” are numbered 1 through 5 representing regions from coolest north/northwest regions to warmest south/southeast regions across New York; these correspond with Warm-Humid, Marine VBZc&De2VBladium Marine Subtropical HotSummer ColdWinter ColdSummer Moderate Winter regions respectively. A Weather Station is used for normalizing Savings Data which a location like described Niagara Falls International Airport that obtains historical average temperature values from various temperatures sources . Weather Stations Normalization compares day-of vs seasonal temperature difference outside homes against model prediction retrofit reduction predictions inside home without weather normalizing watt reduction products can be over or under estimated depending on current season vs expected seasons which this model accounts  The estimated annual electric savings are calculated using factors such as pre-retrofit baseline electric kWh post-retrofit usage electric kWh evaluated annual electric savings calculated by open source library software installed by customers neighborhood ? measured GHG emission reductions determined with assumptions provided input device SDK so on life cycle greenhouse gas emission reductions also tracked documented impact studies have been conducted verify conclusion accuracy projected values reported nyserda industry rebate programs benchmarking standardized meter data allowing future compare patterns? measurements document capture utilities grid management initiated demand response events companies target focus market .   Moving forward Total Project Cost is figure analyzed depending estimates provided\n\n### Research Ideas\n> - Developing an interactive map to visualize residential energy efficiency data and gain insights into areas with the greatest improvements in energy savings. \n> - Using machine learning to detect patterns between climate zones, weather stations, and energy savings to identify areas where efficiency measures are the most effective. \n> - Creating a comparative analysis of estimated vs actual annual energy consumption for retrofits in this dataset to inform future project planning decisions\n\n### Acknowledgements\n> If you use this dataset in your research, please credit the original authors.\n> [Data Source](https://data.world/stateofny)\n> \n>\n\n\n### License\n> \n> \n> See the dataset description for more information.\n\n### Columns\n\n**File: residential-existing-homes-one-to-four-units-energy-efficiency-meter-evaluated-project-data-2007-201-1.csv**\n| Column name                                      | Description                                                                   |\n|:-------------------------------------------------|:------------------------------------------------------------------------------|\n| **Project County**                               | The county in which the project was completed. (String)                       |\n| **Project City**                                 | The city in which the project was completed. (String)                         |\n| **Project ZIP**                                  | The ZIP code in which the project was completed. (String)                     |\n| **Climate Zone**                                 | The climate zone in which the project was completed. (String)                 |\n| **Weather Station**                              | The weather station used to normalize the energy usage data. (String)         |\n| **Weather Station-Normalization**                | The method used to normalize the energy usage data. (String)                  |\n| **Project Completion Date**                      | The date the project was completed. (Date)                                    |\n| **Customer Type**                                | The type of customer the project was completed for. (String)                  |\n| **Size of Home**                                 | The size of the home in which the project was completed. (Integer)            |\n| **Volume of Home**                               | The volume of the home in which the project was completed. (Integer)          |\n| **Number of Units**                              | The number of units in the home in which the project was completed. (Integer) |\n| **Year Home Built**                              | The year the home in which the project was completed was built. (Integer)     |\n| **Total Project Cost ($)**                       | The total cost of the project. (Integer)                                      |\n| **Contractor Incentive ($)**                     | The incentive given to the contractor for completing the project. (Integer)   |\n| **Total Incentives ($)**                         | The total incentives given for the project. (Integer)                         |\n| **Amount Financed Through Program ($)**          | The amount of money financed through the program for the project. (Integer)   |\n| **Estimated Annual Electric Savings (kWh)**      | The estimated annual electric savings in kWh. (Integer)                       |\n| **Estimated Annual Gas Savings (MMBtu)**         | The estimated annual gas savings in MMBtu. (Integer)                          |\n| **Estimated First Year Energy Bill Savings ($)** | The estimated first year energy bill savings in dollars. (Integer)            |\n| **Baseline Electric (kWh)**                      | The baseline electric usage in kWh. (Integer)                                 |\n| **Baseline Gas (MMBtu)**                         | The baseline gas usage in MMBtu. (Integer)                                    |\n| **Reporting Electric (kWh)**                     | The reported electric usage in kWh. (Integer)                                 |\n| **Reporting Gas (MMBtu)**                        | The reported gas usage in MMBtu. (Integer                                     |\n\n### Acknowledgements\n> If you use this dataset in your research, please credit the original authors.\n> If you use this dataset in your research, please credit [State of New York](https://data.world/stateofny).\n\n",
    "licenses": [
        {
            "hasName": true,
            "name": "other",
            "nameNullable": "other"
        }
    ],
    "null_count": 5412,
    "num_entries": 135124,
    "row_count": 3652,
    "source": "kaggle",
    "tags": [
        "energy",
        "data analytics"
    ],
    "title": "Residential Home Energy Efficiency",
    "topic": "energy",
    "url": "kaggle.com/datasets/thedevastator/residential-home-energy-efficiency",
    "usability": 0.9411764705882353
}