{
    "col_count": 17,
    "col_names": [
        "Unnamed: 0",
        "Unnamed: 0_level_0",
        "2016",
        "Unnamed: 3",
        "2017",
        "Unnamed: 5",
        "2018",
        "Unnamed: 7",
        "2019",
        "Unnamed: 9",
        "2020",
        "Unnamed: 11",
        "2021",
        "Unnamed: 13",
        "2019.1",
        "2021.1",
        "Share of totalconsumption"
    ],
    "description": "**# Solar Power Energy by Country**\n\nMany countries and territories have installed significant solar power capacity into their electrical grids to supplement or provide an alternative to conventional energy sources. Solar power plants use one of two technologies:\n\n- Photovoltaic (PV) systems use solar panels, either on rooftops or in ground-mounted solar farms, converting sunlight directly into electric power.\n- Concentrated solar power (CSP, also known as \"concentrated solar thermal\") plants use solar thermal energy to make steam, that is thereafter converted into electricity by a turbine.\n\n- Worldwide growth of photovoltaics is extremely dynamic and varies strongly by country. By the end of 2019, a cumulative amount of 629 GW of solar power was installed throughout the world.[3] By early 2020, the leading country for solar power was China with 208 .Accounting for one-third of global installed solar capacity. As of 2020, there are at least 37 countries around the world with a cumulative PV capacity of more than one gigawatt.\n\n- The top installers of 2016 through 2019 were China, the United States, and India.[6][7] The available solar PV capacity in Honduras is now sufficient to supply 12.5% of the nation's electrical energy while Australia is approaching 11%. Italy, Germany and Greece can produce between 7% and 8% of their respective annual domestic electricity consumption. Germany, situated in a region with only 1000 kWh per kWp solar potential, has produced up to 40 GW of power during peak hours on 27 April 2021 more than 60% of the necessary 65 GW.\n\n- After an almost two decade long hiatus, deployment of CSP resumed in 2007. However, the design for several new projects is being changed to cheaper photovoltaics.[ Most operational CSP stations are located in Spain and the United States, while large solar farms using photovoltaics are being constructed in an expanding list of geographic regions.",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 449,
    "num_entries": 1581,
    "row_count": 93,
    "source": "kaggle",
    "tags": [
        "energy",
        "renewable energy",
        "data analytics",
        "electricity",
        "forcats"
    ],
    "title": "Solar Power Energy by Country",
    "topic": "energy",
    "url": "kaggle.com/datasets/rajkumarpandey02/solar-power-energy-by-country",
    "usability": 0.9411764705882353
}