{
    "col_count": 6,
    "col_names": [
        "datetime",
        "id",
        "name",
        "geoid",
        "geoname",
        "value"
    ],
    "description": "### Context\n\nThis dataset is a daily time series of electricity demand, generation and prices in Spain from 2014 to 2018. It is gathered from ESIOS, a website managed by REE (Red Electrica Española) which is the Spanish TSO (Transmission System Operator)\n\nA TSO main function is to operate the electrical system and to invest in new transmission (high voltage) infrastructure.\n(https://www.ree.es/en/about-us/business-activities/electricity-business-in-Spain)\n\nAs a system operator, REE forecast electricity demand and offer and runs daily actions . As a result of daily actions,  a PBF Plan Básico de Funcionamiento) is yielded. This is a basic schedulling of energy production (upon it several mechanisms are triggerd to ensure supply)\n\nEnery and prices data can be downloaded from : https://www.esios.ree.es/en\n\nOMIE (Operador del Mercado Iberico de Electricidad) is responsible for running those daily actions and also offers interesting data.\nhttp://www.omie.es/en/inicio\n\n### Content\nOriginal values are kept, so some names in Spanish are shown. Column name is describes each time series, so I provide a description of each name:\n\n* Demanda programada PBF total (MWh): Schedulled Total Demand\n* Demanda real (MW): Actual demanded power\n* Energía asignada en Mercado SPOT Diario España (MWh): Energy traded in daily spot Spanish market (OMIE)\n* Energía asignada en Mercado SPOT Diario Francia (MWh): Energy traded in daily spot French market\n* Generación programada PBF Carbón (MWh): Schedulled Coal electricity generation              \n* Generación programada PBF Ciclo combinado (MWh): Schedulled Combined Cycle electricity generation\n* Generación programada PBF Eólica: (MWh): Schedulled Wind electricity generation\n* Generación programada PBF Gas Natural Cogeneración (MWh): Schedulled Natural Gas electricity Co-generation\n* Generación programada PBF Nuclear (MWh): Schedulled Nuclear electricity generation\n* Generación programada PBF Solar fotovoltaica (MWh): Schedulled Photovoltaic electricity generation\n* Generación programada PBF Turbinación bombeo (MWh): Schedulled Reversible-Hydro electricity generation\n* Generación programada PBF UGH + no UGH (MWh): Schedulled Total Hydro electricity generation\n* Generación programada PBF total (MWh): Schedulled Total electricity generation\n* Precio mercado SPOT Diario ESP (€/MWh): Daily spot Spain market price\n* Precio mercado SPOT Diario FRA  (€/MWh): Daily spot France market price\nPrecio mercado SPOT Diario POR   (€/MWh): Daily spot Portugal market price\n* Rentas de congestión mecanismos implícitos diario Francia exportación (€/MWh): Daily spot export from France price\n* Rentas de congestión mecanismos implícitos diario Francia importación (€/MWh): Daily spot import to France price\n* Rentas de congestión mecanismos implícitos diario Portugal exportación (€/MWh): Daily spot export from Portugal price\n* Rentas de congestión mecanismos implícitos diario Portugal importación  (€/MWh): Daily spot import to Portugal price\n\nOriginal data format is maintained, just in case it is necessary to append new data downloaded from Esios, as a result, geo columns are null.\n\n### Inspiration\n\nI love energy and data and I couldn't find many datasets to practice daily forecasts. I hope that many data and energy enthusiasts find it interesting and enjoy it.",
    "licenses": [
        {
            "hasName": true,
            "name": "unknown",
            "nameNullable": "unknown"
        }
    ],
    "null_count": 63990,
    "num_entries": 241272,
    "row_count": 40212,
    "source": "kaggle",
    "tags": [
        "energy",
        "electricity"
    ],
    "title": "Spanish Electricity Market: Demand, Gen. & Price",
    "topic": "energy",
    "url": "kaggle.com/datasets/manualrg/spanish-electricity-market-demand-gen-price",
    "usability": 0.7647058823529411
}