{
    "col_count": 18,
    "col_names": [
        "id",
        "artist_name",
        "track_name",
        "track_id",
        "popularity",
        "danceability",
        "energy",
        "key",
        "loudness",
        "mode",
        "speechiness",
        "acousticness",
        "instrumentalness",
        "liveness",
        "valence",
        "tempo",
        "duration_ms",
        "time_signature"
    ],
    "description": "### Dataset info\n\nTop 50 most listened songs in the world for year 2021 in Spotify. This dataset has 14 descriptive variables about the songs.\n\n\n### Data description\n\n- Popularity - The higher the value the more popular the song is\n- Danceability - The higher the value, the easier it is to dance to this song\n- Energy - The energy of a song - the higher the value, the more energtic. song\n- Key - the key the track is in. Integers map to pitches using standard Pitch Class notation. E.g. 0 = C, 1 = C♯/D♭, 2 = D, and so on. If no key was detected, the value is -1 (range: -1; 11)\n- Loudness (dB) - The higher the value, the louder the song\n- Mode - indicates the modality (major or minor) of a track, the type of scale from which its melodic content is derived. Major is represented by 1 and minor is 0\n- Speechiness - The higher the value the more spoken word the song contains\n- Acousticness - The higher the value the more acoustic the song is\n- Instrumentalness - the number of vocals in a song. The closer the value to 1.0, the more instrumental the song is\n- Liveness - The higher the value, the more likely the song is a live recording\n- Valence - The higher the value, the more positive mood for the song\n- Tempo - the overall estimated tempo of a track in beats per minute (BPM)\n- Duration - duration of the song in ms\n- Time signature - an estimated time signature. The time signature (meter) is a notational convention to specify how many beats are in each bar (or measure). The time signature ranges from 3 to 7 indicating time signatures of \"3/4\", to \"7/4\"\n\n*Detailed explanation of features can be found here:* https://developer.spotify.com/documentation/web-api/reference/#/operations/get-audio-features\n\n\n\n### Source\n\nTop 50 songs of 2021 playlist in Spotify. I would like to thank Spotify for providing this readily accessible data.\nImage source: https://media.pitchfork.com/photos/6012ef11b752509babbe8191/2:1/w_2560%2Cc_limit/Spotify.png\n\n\n### Inspiration\n\nWas inspired by Leonardo Henrique Spotify datasets: https://www.kaggle.com/leonardopena/top50spotify2019\n\n- What are the most popular artists in 2021?\n- How danceability of the song influences its popularity?\n- What are the best key and modality for a song to be \"popular\"?\n\n## Hope you enjoy this dataset!",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 0,
    "num_entries": 900,
    "row_count": 50,
    "source": "kaggle",
    "tags": [
        "arts and entertainment",
        "music",
        "art",
        "intermediate"
    ],
    "title": "Spotify top 50 songs in 2021",
    "topic": "energy",
    "url": "kaggle.com/datasets/equinxx/spotify-top-50-songs-in-2021",
    "usability": 1.0
}