{
    "col_count": 21,
    "col_names": [
        "ï»¿country",
        "Year",
        "Region",
        "CO2 emissions from fuel combustion (MtCO2)",
        "Average CO2 emission factor (tCO2/toe)",
        "CO2 intensity at constant purchasing power parities (kCO2/$15p)",
        "Total energy production (Mtoe)",
        "Total energy consumption (Mtoe)",
        "Share of renewables in electricity production (%)",
        "Share of electricity in total final energy consumption (%)",
        "Oil products domestic consumption (Mt)",
        "Refined oil products production (Mt)",
        "Natural gas production (bcm)",
        "Natural gas domestic consumption (bcm)",
        "Energy intensity of GDP at constant purchasing power parities (koe/$15p)",
        "Electricity production (TWh)",
        "Electricity domestic consumption (TWh)",
        "Coal and lignite domestic consumption (Mt)",
        "Share of wind and solar in electricity production (%)",
        "Crude oil production (Mt)",
        "Coal and lignite production (Mt)"
    ],
    "description": "# **World Energy Yearbook 1990 - 2020.**\n\n\n## *Abbreviations:*\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n**Mtoe**\tmillion tons of oil equivalent (103 toe)\t\t\t\t\t\t\t\t\t\t\n**toe**\ttons of oil equivalent\t\t\t\t\t\t\t\t\t\t\n**koe**\tkilo of oil equivalent (10-3 toe)\t\t\t\t\t\t\t\t\t\t\n**Mt**\tmillion tons\t\t\t\t\t\t\t\t\t\t\n**bcm**\tbillion cubic meters (109 cubic meters)\t\t\t\t\t\t\t\t\t\t\n**TWh**\tterawatt hour\t\t\t\t\t\t\t\t\t\t\n**tCO2**\ttons of carbon dioxide\t\t\t\t\t\t\t\t\t\t\n**kCO2**\tkilogramme of carbon dioxide (10-3 tCO2)\t\t\t\t\t\t\t\t\t\t\n\n## **Glossary**\n\n- Balance of trade: The trade balance is the difference between imports and exports. The balance of a net exporter appears as a negative value (-). The balance of geographic and geopolitical zones is simply the sum of the trade balance of all countries.\n\n- CO2 emissions from fuel combustion: CO2 emissions cover only the emissions from fossil fuel combustion (coal, oil and gas). They are calculated according to the UNFCCC methodology. Here the reference approach is presented, ie the sum of CO2 emissions of each energy.\n\n- CO2 intensity: CO2 intensity is the ratio of CO2 emissions from fuel combustion over Gross Domestic Product (GDP) measured in constant US $ at purchasing power parities. It measures the CO2 emitted to generate one unit of GDP. GDP is expressed at constant exchange rate and purchasing power parity to remove the impact of inflation and reflect differences in general price levels and relate energy consumption to the real level of economic activity. Using purchasing power parity rates for GDP instead of exchange rates increases the value of GDP in regions with a low cost of living, and therefore decreases their energy intensities.\n\n- Crude oil: Crude oil includes all liquid hydrocarbons to be refined: crude oil, liquids from natural gas (NGL), and semi-refined products.\n\n- Crude oil, coal and lignite production : corresponds to gross production.\n\n- Electricity production: Electricity production corresponds to gross production. It includes public production (production of private and public electricity utilities) and industrial producers for their own uses, by any type of power plant (including cogeneration).\n\n- Energy intensity of GDP at constant purchasing power parities: The energy intensity is the ratio of primary energy consumption over Gross Domestic Product (GDP) measured in constant US $ at purchasing power parities. It measures the total amount of energy necessary to generate one unit of GDP. GDP is expressed at constant exchange rate and purchasing power parity to remove the impact of inflation and reflect differences in general price levels and relate energy consumption to the real level of economic activity. Using purchasing power parity rates for GDP instead of exchange rates increases the value of GDP in regions with a low cost of living, and therefore decreases their energy intensities.\n\n- Natural gas production: Natural gas production corresponds to the marketed production (i.e. excluding quantities flared or reinjected).\n\n- NGL : Natural Gas Liquids\n\n- Oil products: Oil products are all liquid hydrocarbons, obtained by the refining of crude oil and NGL and by treatment of natural gas, in particular, LPG production (Liquid Petroleum Gas) includes LPG from natural gas separation plants. Ethanol used as motor fuel in Brazil as well as fuels derived from coal in South Africa are not included in oil products.\n\n- Share of renewables in electricity production: Ratio between the electricity production from renewables (hydro, wind, geothermal and solar) and the total electricity production.\n\n- Share of wind and solar in electricity production: Electricity produced from wind and solar energy divided by the total electricity production.\n\n- Share of electricity in total final energy consumption: Final electricity demand divided by the total final energy consumption. \n\n- Total primary production: Primary production evaluates the quantity of natural energy resources (\"primary energy sources\") extracted or produced. For natural gas, the quantities flared or reinjected are excluded. Production of hydro, geothermal, nuclear and wind electricity is considered as primary production.\n\n- Total energy consumption: The total energy consumption is the balance of primary production, external trade, marine bunkers and stock changes. The total energy consumption includes biomass.For the world, marine bunkers are included. This induces a gap with the sum of regions.\n\n- Average CO2 emission factor: The average CO2 emission factor (carbon factor) is calculated doing the ratio between emissions over primary energy consumption.\n\n\n\t\t\t\t\t\t\t\n",
    "licenses": [
        {
            "hasName": true,
            "name": "world-bank",
            "nameNullable": "world-bank"
        }
    ],
    "null_count": 0,
    "num_entries": 28644,
    "row_count": 1364,
    "source": "kaggle",
    "tags": [
        "energy"
    ],
    "title": "World energy data 1990 - 2020",
    "topic": "energy",
    "url": "kaggle.com/datasets/shub218/energy-data-1990-2020",
    "usability": 0.8235294117647058
}