{
    "col_count": 11,
    "col_names": [
        "user_name",
        "user_location",
        "user_followers",
        "user_friends",
        "user_verified",
        "date",
        "text",
        "hashtags",
        "source",
        "language",
        "is_retweet"
    ],
    "description": "From Wikipedia:\n\nThe Dutch childcare benefits scandal (Dutch: kinderopvangtoeslagaffaire or toeslagenaffaire, lit. '[childcare] benefits affair') is a political scandal in the Netherlands concerning false allegations of fraud made by the Tax and Customs Administration while attempting to regulate the distribution of childcare benefits. Between 2013 and 2019, authorities wrongly accused an estimated 26,000 parents of making fraudulent benefit claims, requiring them to pay back the allowances they had received in their entirety. In many cases, this sum amounted to tens of thousands of euros, driving families into severe financial hardship.\n\nThe scandal was brought to public attention in September 2018. Investigators have subsequently described the working procedure of the Tax and Customs Administration as \"discriminatory\" and filled with \"institutional bias\". On 15 January 2021, two months before the 2021 general election, the third Rutte cabinet resigned over the scandal following a parliamentary inquiry into the matter, which concluded that \"fundamental principles of the rule of law\" had been violated.\n\nhttps://en.wikipedia.org/wiki/Dutch_childcare_benefits_scandal\n\n",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 5951,
    "num_entries": 88968,
    "row_count": 8088,
    "source": "kaggle",
    "tags": [
        "politics"
    ],
    "title": "Dutch politics: the childcare benefits scandal",
    "topic": "politics",
    "url": "kaggle.com/datasets/konradb/dutch-politics-the-childcare-benefits-scandal",
    "usability": 0.7647058823529411
}