{
    "col_count": 7,
    "col_names": [
        "headline",
        "link",
        "source",
        "is_sarcastic",
        "is_binnenland",
        "is_buitenland",
        "is_politiek"
    ],
    "description": "### Context\nThis dataset contains news headlines of two Dutch news websites. All sarcastic headlines were collected from the [Speld.nl](https://speld.nl/) (the Dutch equivalent of The Onion) whereas all \"normal\" headlines were collected from the news website [Nu.nl](https://www.nu.nl/). \n\n### Content\nNext to the news headlines the dataset contains a sarcasm label, the source, and the news subject. News on three different subjects was collected: politics, foreign, and domestic news. Some headlines appear multiple times because they are listed under multiple subjects. For some applications, it might be useful to delete duplicates. The following columns are available:\n\n* Headline: the original news headline\n* link: the URL to the original news article\n* source: either speld.nl or nu.nl\n* is_sarcastic: boolean (speld being sarcastic and nu.nl not)\n* is_binnenland: boolean for news category which translates to \"domestic news\"\n* is_buitenland: boolean for news category which translates to \"foreign news\"\n* is_politiek: boolean for news category which translates to \"political news\"\n\n\n### Acknowledgements\nThe idea for creating this dataset was sparked by [the dataset](https://www.kaggle.com/rmisra/news-headlines-dataset-for-sarcasm-detection) from Rishabh Misra which contains English news headlines.\n\n\n### Inspiration\n\nCan you detect sarcastic news headlines? Is sarcasm harder to detect in certain subjects of news? ",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 0,
    "num_entries": 171654,
    "row_count": 24522,
    "source": "kaggle",
    "tags": [
        "nlp",
        "text mining",
        "classification",
        "tabular",
        "news"
    ],
    "title": "Dutch news headlines for sarcasm detection",
    "topic": "politics",
    "url": "kaggle.com/datasets/harrotuin/dutch-news-headlines",
    "usability": 1.0
}