{
    "col_count": 12,
    "col_names": [
        "account_id",
        "post_id",
        "Category",
        "Page",
        "Post URL",
        "Date Published",
        "Post Type",
        "Rating",
        "Debate",
        "share_count",
        "reaction_count",
        "comment_count"
    ],
    "description": "### Context\n\nDuring the 2016 US presidential election, the phrase “fake news” found its way to the forefront in news articles, tweets, and fiery online debates the world over after misleading and untrue stories proliferated rapidly. [BuzzFeed News][1] analyzed over 1,000 stories from hyperpartisan political Facebook pages selected from the right, left, and mainstream media to determine the nature and popularity of false or misleading information they shared.\n \n### Content\n\nThis dataset supports the original story [“Hyperpartisan Facebook Pages Are Publishing False And Misleading Information At An Alarming Rate”][2] published October 20th, 2016. Here are more details on the methodology used for collecting and labeling the dataset (reproduced from the story):\n  \n**More on Our Methodology and Data Limitations**\n\n“Each of our raters was given a rotating selection of pages from each category on different days. In some cases, we found that pages would repost the same link or video within 24 hours, which caused Facebook to assign it the same URL. When this occurred, we did not log or rate the repeat post and instead kept the original date and rating. Each rater was given the same guide for how to review posts:\n \n* “*Mostly True*: The post and any related link or image are based on factual information and portray it accurately. This lets them interpret the event/info in their own way, so long as they do not misrepresent events, numbers, quotes, reactions, etc., or make information up. This rating does not allow for unsupported speculation or claims.\n \n* “*Mixture of True and False*: Some elements of the information are factually accurate, but some elements or claims are not. This rating should be used when speculation or unfounded claims are mixed with real events, numbers, quotes, etc., or when the headline of the link being shared makes a false claim but the text of the story is largely accurate. It should also only be used when the unsupported or false information is roughly equal to the accurate information in the post or link. Finally, use this rating for news articles that are based on unconfirmed information.    \n\n* “*Mostly False*: Most or all of the information in the post or in the link being shared is inaccurate. This should also be used when the central claim being made is false.    \n \n* “*No Factual Content*: This rating is used for posts that are pure opinion, comics, satire, or any other posts that do not make a factual claim. This is also the category to use for posts that are of the “Like this if you think...” variety.\n \n“In gathering the Facebook engagement data, the API did not return results for some posts. It did not return reaction count data for two posts, and two posts also did not return comment count data. There were 70 posts for which the API did not return share count data. We also used CrowdTangle's API to check that we had entered all posts from all nine pages on the assigned days. In some cases, the API returned URLs that were no longer active. We were unable to rate these posts and are unsure if they were subsequently removed by the pages or if the URLs were returned in error.”\n \n### Acknowledgements\n \nThis dataset was originally published on GitHub by BuzzFeed News here: https://github.com/BuzzFeedNews/2016-10-facebook-fact-check \n \n### Inspiration\n \nHere are some ideas for exploring the hyperpartisan echo chambers on Facebook:\n \n* How do left, mainstream, and right categories of Facebook pages differ in the stories they share?\n\n* Which types of stories receive the most engagement from their Facebook followers? Are videos or links more effective for engagement?\n\n* Can you replicate BuzzFeed’s findings that “the least accurate pages generated some of the highest numbers of shares, reactions, and comments on Facebook”?\n\n\n#[Start a new kernel][3]\n\n\n  [1]: https://www.kaggle.com/buzzfeed\n  [2]: https://www.buzzfeed.com/craigsilverman/partisan-fb-pages-analysis?utm_term=.kq9kqJDZ2#.ia1QB2KJl.\n  [3]: https://www.kaggle.com/buzzfeed/fact-checking-facebook-politics-pages/kernels?modal=true",
    "licenses": [
        {
            "hasName": true,
            "name": "unknown",
            "nameNullable": "unknown"
        }
    ],
    "null_count": 2058,
    "num_entries": 27384,
    "row_count": 2282,
    "source": "kaggle",
    "tags": [
        "politics",
        "internet",
        "social networks"
    ],
    "title": "Fact-Checking Facebook Politics Pages",
    "topic": "politics",
    "url": "kaggle.com/datasets/mrisdal/fact-checking-facebook-politics-pages",
    "usability": 0.7352941176470589
}