{
    "col_count": 7,
    "col_names": [
        "unit_id",
        "article_title",
        "article_content",
        "source",
        "date",
        "location",
        "labels"
    ],
    "description": "**Context**\n\nMost currently available fake news datasets revolve around US politics, entrainment news or satire. They are typically scraped from fact-checking websites, where the articles are labeled by human experts.\nThis dataset around the Syrian war. Given the specific nature of news reporting on incidents of wars and the lack of available sources from which manually-labeled news articles can be scraped.\n\n**Content**\n\nOur dataset consists of news articles from several media outlets representing mobilisation press, loyalist press, and diverse print media.\nThe dataset consists of a set of articles/news labeled by 0 (fake) or 1 (credible).\nThe dataset consists of 804 articles labeled as true or fake and that is ideal for training machine learning models to predict the credibility of news articles\n\n\n**Acknowledgements**\n\nCredibility of articles are computed with respect to a ground truth information obtained from the Syrian Violations Documentation Center (VDC). This dataset is collected by researchers at American University of Beirut(AUB).\n\n**Inspiration**\n\nI know the amount of articles in this dataset is not good enough to get a good acuuracy in prediction, but I hope It will be the seed of great work in the future.\n\n. ",
    "licenses": [
        {
            "hasName": true,
            "name": "EU ODP Legal Notice",
            "nameNullable": "EU ODP Legal Notice"
        }
    ],
    "null_count": 0,
    "num_entries": 5628,
    "row_count": 804,
    "source": "kaggle",
    "tags": [
        "politics",
        "nlp",
        "text mining",
        "classification",
        "text",
        "news"
    ],
    "title": "Fake News Dataset",
    "topic": "politics",
    "url": "kaggle.com/datasets/mohamadalhasan/a-fake-news-dataset-around-the-syrian-war",
    "usability": 0.8235294117647058
}