{
    "col_count": 11,
    "col_names": [
        "SOURCE",
        "SURVERYPERIOD",
        "DATEFORMATTED",
        "SAMPLE",
        "FAVORABLE",
        "UNFAVORABLE",
        "MARGIN",
        "CANDIDATE",
        "DAYS_TO_GENERAL_ELECTION",
        "ELECTION_YEAR",
        "ELECTION_DATE"
    ],
    "description": "### Context\n\nIt's that time again, a US presidential election will be here soon enough. While state and national polls will receive all the attention, we will hear about a candidates \"Likeability\". However, these polls are not often analyzed with the same rigor. It's time for that to end. \n\n\n### Content\n\nThe data provided includes polling information for polls published measuring a political candidates \"Favorables\" or \"Likeability\". Polling data for Hillary Clinton, Bernie Sanders, Joe Biden and Donald Trump are included. The data are in nice tabular format and ready for analysis.  \n\n\n### Acknowledgements\n\nThank you to realclearpolitics.com for openly publishing the data on their website in easy to acquire tabular form. \n\n\n### Inspiration\n\n\"Likeability\"  is often discussed and measured in politics,but is it ever analyzed?  Does it receive the appropriate scrutiny or attention?  How does \"Likeability\" relate to electoral success? What factors impact a political candidate's favorables?  This data set has enough strength to stand on its own, but also serves as a good input to a broader analysis.  Does a candidate's favorables have \"seasonality\"? Do their ratings go up or down as election day nears? Does distance make the heart grow fonder? Can we forecast a candidate's favorables? What is more important, a candidate's absolute number or their margin relative to their opponent for electoral success? How do these polls correlate with state and national polling?",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 0,
    "num_entries": 14982,
    "row_count": 1362,
    "source": "kaggle",
    "tags": [
        "politics"
    ],
    "title": "Favorable-Unfavorable Polling for US Candidates",
    "topic": "politics",
    "url": "kaggle.com/datasets/bag189/favorableunfavorable-polling-for-us-candidates",
    "usability": 1.0
}