{
    "col_count": 10,
    "col_names": [
        "Year",
        "Housing Units",
        "People Left Homeless",
        "Minors Left Homeless",
        "Area",
        "Type of Structure",
        "Demolish Scope",
        "District",
        "Demolition Reason",
        "Demolition carried out by"
    ],
    "description": "### Context\n\nIsrael-Palestine conflict is a long standing questions mark on the face of this world. Israel's forced demolitions of Palestine's houses is a common theme that should be classified under war crimes. Israel demolish houses for three main reasons: on-grounds of unlawful constructio, for military purposes and as punishments. More often the victims are harmless civilians and minors. This dataset is an attempt to document the ordeal.\n\n\n### Content\n\nThe dataset contains 270 campaigns of forced house demolitions of Palestine homes from 2004-2021 that resulted in destruction of 5498 homes and displaced 25,730 people including 5,998 minors. The data contains the year, number of housing units destroyed, number of misplaced residents, number of misplaced minors, area of demolition, type of building structure, demolition scope (complete, partial), district, and the reason for demolition (Military encroachments, as punishment, or on-grounds of unlawful construction). \n\n\n### Acknowledgements\n\nWe like to thank news websites, NGOs working on this conflict and BTSelem\n\n### Inspiration\n\nSee how you can use data science to raise awareness about this conflict\n\n1. Can you visualize the damage and map it geographically?\n2. Can you calculate the human cost per mile?\n3. Can you calculate the cost of destruction?\n4. Can you compare and contrast it with other war zones?\n5. What else you can find?\n",
    "licenses": [
        {
            "hasName": true,
            "name": "copyright-authors",
            "nameNullable": "copyright-authors"
        }
    ],
    "null_count": 417,
    "num_entries": 2720,
    "row_count": 272,
    "source": "kaggle",
    "tags": [
        "politics",
        "tabular",
        "text",
        "news"
    ],
    "title": "Forced Home Demolitions in Palestine (2004-2021)",
    "topic": "politics",
    "url": "kaggle.com/datasets/zusmani/home-demolitions-in-palestine-20042021",
    "usability": 1.0
}