{
    "col_count": 614,
    "col_names": [
        "continent",
        "country",
        "year",
        "demox_eiu",
        "income_per_person",
        "invest_%_gdp",
        "tax_%_gdp",
        "gini_index",
        "2006",
        "2007",
        "2008",
        "2009",
        "2010",
        "2011",
        "2012",
        "2013",
        "2014",
        "2015",
        "2016",
        "2017",
        "2018",
        "1800",
        "1801",
        "1802",
        "1803",
        "1804",
        "1805",
        "1806",
        "1807",
        "1808",
        "1809",
        "1810",
        "1811",
        "1812",
        "1813",
        "1814",
        "1815",
        "1816",
        "1817",
        "1818",
        "1819",
        "1820",
        "1821",
        "1822",
        "1823",
        "1824",
        "1825",
        "1826",
        "1827",
        "1828",
        "1829",
        "1830",
        "1831",
        "1832",
        "1833",
        "1834",
        "1835",
        "1836",
        "1837",
        "1838",
        "1839",
        "1840",
        "1841",
        "1842",
        "1843",
        "1844",
        "1845",
        "1846",
        "1847",
        "1848",
        "1849",
        "1850",
        "1851",
        "1852",
        "1853",
        "1854",
        "1855",
        "1856",
        "1857",
        "1858",
        "1859",
        "1860",
        "1861",
        "1862",
        "1863",
        "1864",
        "1865",
        "1866",
        "1867",
        "1868",
        "1869",
        "1870",
        "1871",
        "1872",
        "1873",
        "1874",
        "1875",
        "1876",
        "1877",
        "1878",
        "1879",
        "1880",
        "1881",
        "1882",
        "1883",
        "1884",
        "1885",
        "1886",
        "1887",
        "1888",
        "1889",
        "1890",
        "1891",
        "1892",
        "1893",
        "1894",
        "1895",
        "1896",
        "1897",
        "1898",
        "1899",
        "1900",
        "1901",
        "1902",
        "1903",
        "1904",
        "1905",
        "1906",
        "1907",
        "1908",
        "1909",
        "1910",
        "1911",
        "1912",
        "1913",
        "1914",
        "1915",
        "1916",
        "1917",
        "1918",
        "1919",
        "1920",
        "1921",
        "1922",
        "1923",
        "1924",
        "1925",
        "1926",
        "1927",
        "1928",
        "1929",
        "1930",
        "1931",
        "1932",
        "1933",
        "1934",
        "1935",
        "1936",
        "1937",
        "1938",
        "1939",
        "1940",
        "1941",
        "1942",
        "1943",
        "1944",
        "1945",
        "1946",
        "1947",
        "1948",
        "1949",
        "1950",
        "1951",
        "1952",
        "1953",
        "1954",
        "1955",
        "1956",
        "1957",
        "1958",
        "1959",
        "1960",
        "1961",
        "1962",
        "1963",
        "1964",
        "1965",
        "1966",
        "1967",
        "1968",
        "1969",
        "1970",
        "1971",
        "1972",
        "1973",
        "1974",
        "1975",
        "1976",
        "1977",
        "1978",
        "1979",
        "1980",
        "1981",
        "1982",
        "1983",
        "1984",
        "1985",
        "1986",
        "1987",
        "1988",
        "1989",
        "1990",
        "1991",
        "1992",
        "1993",
        "1994",
        "1995",
        "1996",
        "1997",
        "1998",
        "1999",
        "2000",
        "2001",
        "2002",
        "2003",
        "2004",
        "2005",
        "2019",
        "2020",
        "2021",
        "2022",
        "2023",
        "2024",
        "2025",
        "2026",
        "2027",
        "2028",
        "2029",
        "2030",
        "2031",
        "2032",
        "2033",
        "2034",
        "2035",
        "2036",
        "2037",
        "2038",
        "2039",
        "2040"
    ],
    "description": "## Content\n\nThis analysis focuses on income inequailty as measured by the Gini Index* and its association with economic metrics such as GDP per capita, investments as a % of GDP, and tax revenue as a % of GDP. One polical metric, EIU democracy index, is also included.\n\nThe data is for years 2006 - 2016\n\nThis investigation can be considered a starting point for complex questions such as:\n\n1. Is a higher tax revenue as a % of GDP associated with less income inequality?\n2. Is a higher EIU democracy index associated with less income inequality?\n3. Is higher GDP per capita associated with less income inequality?\n4. Is higher investments as a % of GDP associated with less income inequality?\n\nThis analysis uses the gapminder dataset from the Gapminder Foundation.  The Gapminder Foundation is a non-profit venture registered in Stockholm, Sweden, that promotes sustainable global development and achievement of the United Nations Millennium Development Goals by increased use and understanding of statistics and other information about social, economic and environmental development at local, national and global levels.\n\n*The [Gini Index](https://en.wikipedia.org/wiki/Gini_coefficient) is a measure of statistical dispersion intended to represent the income or wealth distribution of a nation's residents, and is the most commonly used measurement of inequality. It was developed by the Italian statistician and sociologist Corrado Gini and published in his 1912 paper Variability and Mutability.\n\nThe dataset contains data from the following GapMinder datasets:\n\n### EIU Democracy Index:\n\n\"This democracy index is using the data from the Economist Inteligence Unit to express the quality of democracies as a number between 0 and 100. It's based on 60 different aspects of societies that are relevant to democracy universal suffrage for all adults, voter participation, perception of human rights protection and freedom to form organizations and parties.\nThe democracy index is calculated from the 60 indicators, divided into five \"\"sub indexes\"\", which are:\n\n1. Electoral pluralism index;\n2. Government index;\n3. Political participation indexm;\n4. Political culture index;\n5. Civil liberty index.\n\nThe sub-indexes are based on the sum of scores on roughly 12 indicators per sub-index, converted into a score between 0 and 100.\n(The Economist publishes the index with a scale from 0 to 10, but Gapminder has converted it to 0 to 100 to make it easier to communicate as a percentage.)\"\nhttps://docs.google.com/spreadsheets/d/1d0noZrwAWxNBTDSfDgG06_aLGWUz4R6fgDhRaUZbDzE/edit#gid=935776888\n\n\n### Income: GDP per capita, constant PPP dollars\n\nGDP per capita measures the value of everything produced in a country during a year, divided by the number of people. The unit is in international dollars, fixed 2011 prices. The data is adjusted for inflation and differences in the cost of living between countries, so-called PPP dollars. The end of the time series, between 1990 and 2016, uses the latest GDP per capita data from the World Bank, from their World Development Indicators. To go back in time before the World Bank series starts in 1990, we have used several sources, such as Angus Maddison.\nhttps://www.gapminder.org/data/documentation/gd001/\n\n\n### Investments (% of GDP)\nCapital formation is a term used to describe the net capital accumulation during an accounting period for a particular country. The term refers to additions of capital goods, such as equipment, tools, transportation assets, and electricity. Countries need capital goods to replace the older ones that are used to produce goods and services. If a country cannot replace capital goods as they reach the end of their useful lives, production declines. Generally, the higher the capital formation of an economy, the faster an economy can grow its aggregate income.\n\n\n### Tax revenue (% of GDP)\nrefers to compulsory transfers to the central governement for public purposes.  Does not include social security.\nhttps://data.worldbank.org/indicator/GC.TAX.TOTL.GD.ZS\n\n## Context\n\nGapminder is an independent Swedish foundation with no political, religious or economic affiliations. Gapminder is a fact tank, not a think tank. Gapminder fights devastating misconceptions about global development. Gapminder produces free teaching resources making the world understandable based on reliable statistics. Gapminder promotes a fact-based worldview everyone can understand.  Gapminder collaborates with universities, UN, public agencies and non-governmental organizations. All Gapminder activities are governed by the board. We do not award grants. Gapminder Foundation is registered at Stockholm County Administration Board. Our constitution can be found here.\n\n\n\n## Acknowledgements\n\nThanks to gapminder.org for organizing the above datasets.\n\n\n## Inspiration\n\nBelow are some research questions associated with the data and some initial conclusions:\n\n**Research Question 1 - Is Income Inequality Getting Worse or Better in the Last 10 Years?**\n\nAnswer:\n\nYes, it is getting better, improving from 38.7 to 37.3\n\nOn a continent basis, all were either declining or mostly flat, except for Africa.\n\n**Research Question 2 - What Top 10 Countries Have the Lowest and Highest Income Inequality?**\n\nAnswer:\n\nLowest: Slovenia, Ukraine, Czech Republic, Norway, Slovak Republic, Denmark, Kazakhstan, Finland, Belarus,Kyrgyz Republic\n\nHighest: Colombia, Lesotho, Honduras, Bolivia, Central African Republic, Zambia, Suriname, Namibia, Botswana, South Africa\n\n**Research Question 3 Is a higher tax revenue as a % of GDP associated with less income inequality?**\n\nAnswer: No\n\n**Research Question 4 - Is Higher Income Per Person - GDP Per Capita associated with less income inequality?**\n\nAnswer: No, but weak negative correlation.\n\n**Research Question 5 - Is Higher Investment as % GDP associated with less income inequality?**\n\nAnswer: No\n\n**Research Question 6 - Is Higher EIU Democracy Index associated with less income inequality?**\n\nAnswer: No, but weak negative correlation.\n\nThe above results suggest that there are other drivers for the overall reduction in income inequality. Futher analysis of additional factors should be undertaken.",
    "licenses": [
        {
            "hasName": true,
            "name": "other",
            "nameNullable": "other"
        }
    ],
    "null_count": 6293,
    "num_entries": 124414,
    "row_count": 2294,
    "source": "kaggle",
    "tags": [
        "business",
        "finance",
        "politics",
        "economics",
        "social issues and advocacy"
    ],
    "title": "GapMinder - Income Inequality",
    "topic": "politics",
    "url": "kaggle.com/datasets/psterk/income-inequality",
    "usability": 0.9705882352941176
}