{
    "col_count": 6,
    "col_names": [
        "Unnamed: 0",
        "Headlines",
        "Summary",
        "Press",
        "Date",
        "Keyword"
    ],
    "description": "This dataset is scraped from 'Google News' Search Results regarding WAR and Conflicts in 21 different countries. The search query keywords are [country] + War. For instance, 'Ukraine War'. The dataset contains '**Headline**', '**Summary**', '**Press**', '**Date**', and '**Keyword**'.\nThe Keyword is the name of the country which is queried in Google News. You can find about 5600 news headlines in the dataset with the topic of WAR. The Google War News Country keywords are: \n**[Afghanistan, Algeria, Chins, Cuba, France, India, Iran, Iraq, Israel, Lebanon, Libya, Nigeria, Pakistan, Palestine, Russia, Sudan, Syria, Ukraine, Venezuela, Vietnam, Yemen ]**\nThis dataset is suitable for different Text Analysis and Natural Language Processing tasks such as **Classification**, **News Similarity (Clustering)**, **Name Entity Recognition (NER)**, **Topic Modeling**, **NEWS Generation**!, **Inline Question Answering** and any other tasks.\nIf you want to get your hands dirty with text analysis regarding WARS, this dataset is FOR YOU!\n\nPlease note:\n- The dataset is not cleaned or preprocessed. \n- The Date of scraping the data is May 10, 2022. So if you see the NEWS DATE eg. 20 hours ago, consider the date from 5/10/2022!\n- The license of the dataset belongs to the data collector, Me. \n- Feel free to download, share and use the data, but I'd be so happy and appreciated it if you **VOTE FOR THE DATASET** in case you find it helpful. \n\n**I hope there will be NO WAR in every land on this planet. **\nEnjoy. \n\n\n\n",
    "licenses": [
        {
            "hasName": true,
            "name": "copyright-authors",
            "nameNullable": "copyright-authors"
        }
    ],
    "null_count": 25,
    "num_entries": 33924,
    "row_count": 5654,
    "source": "kaggle",
    "tags": [
        "politics",
        "nlp",
        "text",
        "multiclass classification",
        "news"
    ],
    "title": "Google War News",
    "topic": "politics",
    "url": "kaggle.com/datasets/armitaraz/google-war-news",
    "usability": 1.0
}