{
    "col_count": 19,
    "col_names": [
        "STATE",
        "CONSTITUENCY",
        "NAME",
        "WINNER",
        "PARTY",
        "SYMBOL",
        "GENDER",
        "CRIMINAL\nCASES",
        "AGE",
        "CATEGORY",
        "EDUCATION",
        "ASSETS",
        "LIABILITIES",
        "GENERAL\nVOTES",
        "POSTAL\nVOTES",
        "TOTAL\nVOTES",
        "OVER TOTAL ELECTORS \nIN CONSTITUENCY",
        "OVER TOTAL VOTES POLLED \nIN CONSTITUENCY",
        "TOTAL ELECTORS"
    ],
    "description": "### Context\n\nWith over 600 Million voters voting for 8500+ candidates across 543 constituencies, the general elections in the world's largest democracy are a potential goldmine of data. While there are existing separate datasets about the votes each candidate received and the personal information of each candidate, there was no comprehensive dataset that included both these information. Thus, this dataset will provide more usability than most existing datasets in this domain.\n\n### Content\n\nI scraped the website of myneta.info to get the personal information of each candidate (as per their own sworn affidavits) and the website of Election Commission of India to get the data about the votes received. I merged both this datasets to create this comprehensive dataset. Only the candidates who secured at least 1% of the total votes polled in their constituency have been included. \n\n### Acknowledgements\n\nI have collected the data from MyNeta.info maintained by the Association for Democratic Reforms and the website of Election Commission of India.\n\n\n### Inspiration\nThere are 2 main tasks that can be performed on this dataset: Exploratory Data Analytics to visualize the impact of each feature of the candidate and the use of machine learning to predict the chances of winning of a candidate. ",
    "licenses": [
        {
            "hasName": true,
            "name": "CC-BY-NC-SA-4.0",
            "nameNullable": "CC-BY-NC-SA-4.0"
        }
    ],
    "null_count": 1960,
    "num_entries": 42997,
    "row_count": 2263,
    "source": "kaggle",
    "tags": [
        "india",
        "business",
        "government",
        "politics",
        "data cleaning",
        "data visualization"
    ],
    "title": "Indian Candidates for General Election 2019",
    "topic": "politics",
    "url": "kaggle.com/datasets/prakrutchauhan/indian-candidates-for-general-election-2019",
    "usability": 0.7058823529411765
}