{
    "col_count": 17,
    "col_names": [
        "Country",
        "European Union",
        "Accession Year",
        "Council Votes",
        "European Parliament Seats",
        "European Free Trade Agreement",
        "European Single Market",
        "European Monetary Union",
        "Currency",
        "Currency Code",
        "Language",
        "Population",
        "Area (kmÂ²)",
        "Population Density",
        "GDP (â\u0082¬, millions)",
        "GDP ($, millions)",
        "GDP per capita ($, millions)"
    ],
    "description": "# Context \n\nThe European Union is a unique economic and political union between twenty-eight countries that together cover much of the continent. It was created in the aftermath of the Second World War to foster economic cooperation and thus avoid conflict. The result was the European Economic Community (EEC), established in 1958, with Belgium, Germany, France, Italy, Luxembourg and the Netherlands as its members. What began as an economic union has evolved into an organization spanning policy areas, from climate, environment and health to external relations and security, justice and migration. The 1993 name change from the European Economic Community (EEC) to the European Union (EU) reflected this.\n\nThe European Union has delivered more than half a century of peace, stability and prosperity, helped raise living standards and launched a single European currency: the Euro. In 2012, the EU was awarded the Nobel Peace Prize for advancing the causes of peace, reconciliation, democracy and human rights in Europe. The single market is the EU's main economic engine, enabling most goods, services, money and people to move freely.\n\n\n# Content\n\nThe European Union covers over 4 million square kilometers and has 508 million inhabitants — the world’s third largest population after China and India. This dataset includes information on each EU member state, candidate state, or European Free Trade Agreement (EFTA) signatory state.\n\n\n# Acknowledgements\n\nThe membership, population, and economic data was published by the European Commission's Eurostat. Gross domestic product and GDP per capita in US dollars was provided by the World Bank.\n\n\n# Inspiration\n\nHow has the European Union grown in the past fifty years? What is the largest country by population or surface area? Which country has the largest economy by gross domestic product? How many different languages are spoken across all the member states?",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 80,
    "num_entries": 629,
    "row_count": 37,
    "source": "kaggle",
    "tags": [
        "government",
        "politics",
        "international relations"
    ],
    "title": "Member States of the European Union",
    "topic": "politics",
    "url": "kaggle.com/datasets/eurostat/european-union",
    "usability": 0.8235294117647058
}