{
    "col_count": 8,
    "col_names": [
        "title",
        "score",
        "id",
        "url",
        "comms_num",
        "created",
        "body",
        "timestamp"
    ],
    "description": "_____\n# Reddit: /r/politics (Submission & Comments)\n### An Insightful Exploration of Popular Opinions and Historical Trends\nBy Reddit [[source]](http://reddit.com/r/politics)\n_____\n\n### About this dataset\n&gt; This dataset presents a unique and insightful exploration into the discourse of political discussion on Reddit's Subreddit Politics. Providing an in-depth collection of post titles, scores, IDs, URLs, comment numbers and timestamps as well as associated bodies and creation data - this data offers invaluable insights into the opinions of the online populace. Using this dataset researchers have the opportunity to identify key recurring topics such as gender, race or immigration through correlational analyses between different topics and generations. Furthermore, using this vast amount of information it is possible to gain a comprehensive understanding of popular discourse, opinion trends and collective sentiments in response to various political issues. By providing us with a powerful lens into public perception on all aspects pertaining to politics - this dataset can be used to uncover valuable perspectives from across the entire political spectrum!\n\n### More Datasets\n&gt; For more datasets, click [here](https://www.kaggle.com/thedevastator/datasets).\n\n### Featured Notebooks\n&gt; - 🚨 **Your notebook can be here!** 🚨! \n\n### How to use the dataset\n&gt; The Analyzing the Political Discourse of Reddit’s Subreddit Politics dataset is an extremely valuable resource for understanding the political discourse on Reddit. With columns denoting post titles, scores, URLs, comment numbers, creation dates, associated bodies and timestamp of when the post was created among other variables – this data can help identify which topics are most debated in the political arena and how they shape public opinion.\n\n### Research Ideas\n&gt; - Using the data to predict political trends at different times, such as election cycles or major political events. \n&gt; - Analyzing the sentiment around certain topics and gauging user opinion on various issues such as current policies or popular candidates. \n&gt; - Creating a natural language processing model to identify recurring topics in political discourse and uncover new themes that may be of interest to the public or politicians alike\n\n### Acknowledgements\n&gt; If you use this dataset in your research, please credit the original authors.\n&gt; [Data Source](http://reddit.com/r/politics)\n&gt;  \n\n### License \n&gt; \n&gt; **License: [CC0 1.0 Universal (CC0 1.0) - Public Domain Dedication](https://creativecommons.org/publicdomain/zero/1.0/)**\n&gt; No Copyright - You can copy, modify, distribute and perform the work, even for commercial purposes, all without asking permission. [See Other Information](https://creativecommons.org/publicdomain/zero/1.0/).\n\n### Columns\n\n**File: politics.csv**\n| Column name   | Description                                             |\n|:--------------|:--------------------------------------------------------|\n| **title**     | The title of the post. (String)                         |\n| **score**     | The number of upvotes the post has received. (Integer)  |\n| **url**       | The URL of the post. (String)                           |\n| **comms_num** | The number of comments the post has received. (Integer) |\n| **created**   | The date and time the post was created. (DateTime)      |\n| **body**      | The body of the post. (String)                          |\n| **timestamp** | The timestamp of the post. (Integer)                    |\n\n### Acknowledgements\n&gt; If you use this dataset in your research, please credit the original authors.\n&gt; If you use this dataset in your research, please credit [Reddit](http://reddit.com/r/politics).\n\n",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 1910,
    "num_entries": 15320,
    "row_count": 1915,
    "source": "kaggle",
    "tags": [
        "politics",
        "social science",
        "data cleaning"
    ],
    "title": "Reddit: /r/politics (Submission & Comments)",
    "topic": "politics",
    "url": "kaggle.com/datasets/thedevastator/analyzing-the-political-discourse-of-reddit-s-su",
    "usability": 0.9411764705882353
}