{
    "col_count": 8,
    "col_names": [
        "Magazine",
        "Issue",
        "Date",
        "Type",
        "Source",
        "Quote",
        "Purpose",
        "Article Name"
    ],
    "description": "### Context\n\nReligious texts play a key role in ISIS ideology, propaganda, and recruitment. This dataset is a compilation of all of the religious and ideological texts (Muslim, Christian, Jewish, and other) used in ISIS English-based magazines. \n\n### Content\n\nWe scraped 15 issues of Dabiq (6/2014 to 7/2016) and 9 issues of Rumiyah (9/2016 to 5/2017) producing a total of 2,685 texts. We classified the data as follows:\n\n - Magazine: Dabiq or Rumiyah\n - Issue #\n - Date (Month and Year)\n - Type of Text (Qur'an, Hadeeth, Religious Figure, etc)\n - Source: What the source of the text was\n - The quote itself\n - Purpose: Support ISIS, Refute Another Group\n - The article from which the quote is derived\n\n### Acknowledgements\n\nWe would like to thank Asma Shah for helping to compile this dataset. Asma is a junior at the University of Maryland, College Park, where she is studying criminal justice and computer science. She is currently an intern with the Department of Justice where she does data science work. She has previously done counter-terrorism research with Fifth Tribe and the National Consortium for the Studies of Terrorism and Responses to Terrorism. \n\nWe would also like to express our gratitude to Abdul Aziz Suraqah (Canada), Saif ul Hadi (India), and Abdulbasit Kassam (Nigeria) for helping with the classification of some of the more obscure texts.\n\n### Inspiration\n\nWe would like this data to be analyzed by religious clerics to develop rebuttals of ISIS propaganda, data scientists to generate insights from the texts, and policymakers to understand how faith can shape countering violent extremism efforts. We also need help classifying some of the data that could not be identified and has been marked 'unknown.'",
    "licenses": [
        {
            "hasName": true,
            "name": "CC0-1.0",
            "nameNullable": "CC0-1.0"
        }
    ],
    "null_count": 1898,
    "num_entries": 21480,
    "row_count": 2685,
    "source": "kaggle",
    "tags": [
        "literature",
        "religion and belief systems",
        "politics"
    ],
    "title": "Religious Texts Used By ISIS",
    "topic": "politics",
    "url": "kaggle.com/datasets/fifthtribe/isis-religious-texts",
    "usability": 0.8235294117647058
}