{
    "col_count": 57,
    "col_names": [
        "ï»¿\"Do you think abortions should be legal under any circumstances",
        " legal only under certain circumstances or illegal in all circumstances?\"",
        "Unnamed: 2",
        "Unnamed: 3",
        "Unnamed: 4",
        "Unnamed: 5",
        "ï»¿\"With respect to the abortion issue",
        " would you consider yourself to be pro-choice or pro-life?\"",
        "Unnamed: 6",
        "ï»¿\"Would you like to see the Supreme Court overturn its 1973 Roe v. Wade decision concerning abortion",
        " or not?\"",
        "ï»¿\"Thinking more generally",
        " do you think abortion should generally be legal or generally illegal during each of the following stages of pregnancy. How about -- [RANDOM ORDER]?\"",
        "ï»¿\"Thinking about how the abortion issue might affect your vote for major offices",
        " would you -- [ROTATED: only vote for a candidate who shares your views on abortion (or) consider a candidate's position on abortion as just one of many important factors (or) not see abortion as a major issue]?\"",
        "ï»¿\"Next",
        " I'm going to read you a list of issues. Regardless of whether or not you think it should be legal",
        " for each one",
        " please tell me whether you personally believe that in general it is morally acceptable or morally wrong. How about abortion?\"",
        "Unnamed: 7",
        "Unnamed: 8",
        " we'd like to know how you feel about the state of the nation in each of the following areas. For each one",
        " please say whether you are -- very satisfied",
        " somewhat satisfied",
        " somewhat dissatisfied or very dissatisfied. If you don't have enough information about a particular subject to rate it",
        " just say so. How about -- the nation's policies regarding the abortion issue?\"",
        "Unnamed: 9",
        "Unnamed: 10"
    ],
    "description": "![](https://www.googleapis.com/download/storage/v1/b/kaggle-user-content/o/inbox%2F12064410%2F66268a15513f366aeeea35cc69051c2b%2Fabortion%20flag.png?generation=1675499090398375&alt=media)\n\n# DAY 17,196 (April 4, 1975 - May 2, 2022)\nThis is a dataset that describes the **changing perspectives** on a **woman's right to choose** in America.\n\nAll data are official figures from **Gallup**, formerly known as the American Institute of Public Opinion, that have been compiled and structured by myself. I decided to create this dataset to explore how American views on abortion have evolved in the decades preceding the Dobbs V. Jackson Women's Health Organization decision. In that particular court case, the Supreme Court also overturned the **1973 Roe V. Wade decision**, ending the *long-standing constitutional right to abortion* in the United States. Abortion has become a fixture of American politics in recent years, but few are able to take a bipartisan stance on the issue. I hope that the **objectiveness of the quantitative data** in this dataset can allow for a **more rational understanding** of the issue.\n\n\n# Data Sources\n##### The primary data source used was Gallup, an analytics company renowned for its expansive public opinion polls. With decades worth of data on the sentiments of Americans, Gallup is an organization uniquely equipped to illustrate the shifting attitudes on abortion. \n\n1. [Gallup's Historical Trends On Abortion](https://news.gallup.com/poll/1576/abortion.aspx) - Gallup publicly released not only their opinion data about abortion, but also attached corresponding visualizations that conveyed to me the analytical potential of a compiled dataset.\n2. [Gallup's \"Where Do Americans Stand On Abortion?\"](https://news.gallup.com/poll/321143/americans-stand-abortion.aspx) - While searching for quality data sources regarding abortion (ex. MMWR, CDC, PMSS), I found this Gallup article, which piqued my interest and led me to their \"Historical Trends\" page.\n\n# Reponses Being Tracked\n- Q1꞉ Should Abortions Be Legal?\n- Q2꞉ Are You Pro-Choice Or Pro-Life (AFTER)?\n- Q2꞉ Are You Pro-Choice Or Pro-Life (NOT AFTER)?\n- Q3꞉ Should Roe V. Wade Be Overturned Or Not?\n- Q4꞉ Which Stage of Pregnancy Should Abortion Be Legal Or Illegal?\n- Q5꞉ How Does A Political Candidateʼs Position On Abortion Affect Your Vote?\n- Q6꞉ Is Abortion Morally Acceptable Or Wrong?\n- Q7꞉ Are You Satisfied Or Dissatisfied With Nationʼs Policies On Abortion?\n\n# Dataset History\n2023-02-04 - Dataset is created (17,474 days after the coverage start date).\n\n[GitHub Repository](https://github.com/justin-2028/US-Perspectives-on-Abortion-1975-2022) - The same data but on GitHub.\n\n# Code Starter\n[Link to Notebook](https://www.kaggle.com/code/justin2028/us-perspectives-on-abortion-code-starter)\n\n# Acknowledgements\nThe idea for this dataset came from Ms. Katlen, my English teacher. A big thank you to her for the suggestion to explore how perspectives have changed about a woman's right to choose :)",
    "licenses": [
        {
            "hasName": true,
            "name": "CC-BY-NC-SA-4.0",
            "nameNullable": "CC-BY-NC-SA-4.0"
        }
    ],
    "null_count": 441,
    "num_entries": 1743,
    "row_count": 253,
    "source": "kaggle",
    "tags": [
        "united states",
        "politics",
        "time series analysis",
        "tabular",
        "social issues and advocacy"
    ],
    "title": "US Perspectives on Abortion (1975-2022)",
    "topic": "politics",
    "url": "kaggle.com/datasets/justin2028/perspectives-on-abortion-1975-2022",
    "usability": 1.0
}