{
    "col_count": 10,
    "col_names": [
        "Class",
        "Year",
        "Region ",
        "Status",
        "CTSA",
        "GOVT",
        "GOVT AIDED",
        "INDEPENDENT",
        "JNV",
        "KV"
    ],
    "description": "Description:\nIn the year 2023, the Central Board of Secondary Education (CBSE) conducted the Class XI examinations across various regions. The dataset presents a comprehensive overview of the results, categorized by different types of schools and regions. The data includes the number of students registered, the number of students who appeared for the exams, and the performance status of each category.\n\nThe results encompass a diverse range of schools, including those under the Central Tibetan School Administration (CTSA), Jawahar Navodaya Vidyalayas (JNV), and Kendriya Vidyalayas (KV), as well as government and government-aided schools, and independent institutions.\n\nThe \"Status\" column provides insights into the outcome of the exams, highlighting the number of students who successfully cleared the examinations. The \"Region\" column denotes the geographic distribution of the schools, allowing for a comprehensive analysis of performance across different areas.\n\nThe dataset is a valuable resource for understanding the educational landscape and performance trends within the CBSE Class XI examinations for the year 2023. It offers an in-depth view of student participation, success rates, and the performance of different types of schools across various regions, contributing to a holistic assessment of the CBSE educational system's effectiveness and impact. Researchers, educators, and policymakers can leverage this data to identify patterns, make informed decisions, and implement targeted interventions to enhance the overall quality of education.",
    "licenses": [
        {
            "hasName": true,
            "name": "GPL-2.0",
            "nameNullable": "GPL-2.0"
        }
    ],
    "null_count": 0,
    "num_entries": 320,
    "row_count": 32,
    "source": "kaggle",
    "tags": [
        "computer science",
        "tabular",
        "e-commerce services",
        "primary and secondary schools",
        "standardized testing"
    ],
    "title": "CBSE Result Statistics Class XII - 2023",
    "topic": "education",
    "url": "kaggle.com/datasets/fiq423ubf/cbse-result-statistics-class-xii-2023",
    "usability": 1.0
}