{
    "description": "Image:  ICT in Education. Class 6th. SCERT Delhi\nhttps://www.youtube.com/watch?app=desktop&v=n9sIGl6gBEo\n\n\"Students who reported the use of computers in mathematics lessons during the month prior to the PISA test (%)\"\n\n\"The following findings, based on an analysis of the 2012 Programme for International Student Assessment (PISA) data, tell us that, despite the pervasiveness of information and communication technologies (ICT) in our daily lives, these technologies have not yet been as widely adopted in formal education. But where they are used in the classroom, their impact on student performance is mixed, at best. In fact, PISA results show no appreciable improvements in student achievement in reading, mathematics or science in most countries that had invested heavily in ICT for education.\"\n\n\"The countries with the greatest integration of ICT in schools are Australia, Denmark, the Netherlands and Norway. Rapid increases in the share of students doing schoolwork on computers can often be related to large-scale laptop-acquisition programmes, such as those observed in Australia, Chile, Greece, New Zealand, Sweden and Uruguay.\"\n\n\"On average, seven out of ten students use computers at school – a proportion unchanged since 2009. Among these students, the frequency of computer use increased in most countries during the period.\nOverall, the relationship between computer use at school and performance is graphically illustrated by a hill shape, which suggests that limited use of computers at school may be better than no use at all, but levels of computer use above the current OECD average are associated with significantly poorer results.\nOn average across TALIS countries, nearly 18% of teachers reported a high level of need to develop their ICT skills for teaching.\"\n\nhttps://gpseducation.oecd.org/IndicatorExplorer?query=13&indicators=N050*N052*N055*N053*N054*N051*N056*N057%20",
    "licenses": [
        {
            "hasName": true,
            "name": "other",
            "nameNullable": "other"
        }
    ],
    "source": "kaggle",
    "tags": [
        "education",
        "tabular"
    ],
    "title": "Computers, education & skills ",
    "topic": "education",
    "url": "kaggle.com/datasets/mpwolke/cusersmarildownloadsictcsv",
    "usability": 1.0
}