{
    "col_count": 15,
    "col_names": [
        "Indicator",
        "Group",
        "State",
        "Subgroup",
        "Phase",
        "Time Period",
        "Time Period Label",
        "Time Period Start Date",
        "Time Period End Date",
        "Value",
        "LowCI",
        "HighCI",
        "Confidence Interval",
        "Quartile Range",
        "Suppression Flag"
    ],
    "description": "```\nThe U.S. Census Bureau, in collaboration with five federal agencies, launched the Household Pulse Survey to produce data on the social and economic impacts of Covid-19 on American households. The Household Pulse Survey was designed to gauge the impact of the pandemic on employment status, consumer spending, food security, housing, education disruptions, and dimensions of physical and mental wellness.\n\nThe survey was designed to meet the goal of accurate and timely weekly estimates. It was conducted by an internet questionnaire, with invitations to participate sent by email and text message. The sample frame is the Census Bureau Master Address File Data. Housing units linked to one or more email addresses or cell phone numbers were randomly selected to participate, and one respondent from each housing unit was selected to respond for him or herself. Estimates are weighted to adjust for nonresponse and to match Census Bureau estimates of the population by age, gender, race and ethnicity, and educational attainment. All estimates shown meet the NCHS Data Presentation Standards for Proportions.\n```",
    "licenses": [
        {
            "hasName": true,
            "name": "U.S. Government Works",
            "nameNullable": "U.S. Government Works"
        }
    ],
    "null_count": 16014,
    "num_entries": 156060,
    "row_count": 10404,
    "source": "kaggle",
    "tags": [
        "healthcare",
        "public health",
        "health",
        "health conditions",
        "jobs and career"
    ],
    "title": "COVID-19 Impact on US Households: Survey Data",
    "topic": "education",
    "url": "kaggle.com/datasets/utkarshx27/mental-health-care",
    "usability": 0.9411764705882353
}