{
    "col_count": 1,
    "col_names": [
        "ï»¿ID;Year_Birth;Education;Marital_Status;Income;Kidhome;Teenhome;Dt_Customer;Recency;MntWines;MntFruits;MntMeatProducts;MntFishProducts;MntSweetProducts;MntGoldProds;NumDealsPurchases;NumWebPurchases;NumCatalogPurchases;NumStorePurchases;NumWebVisitsMonth;AcceptedCmp3;AcceptedCmp4;AcceptedCmp5;AcceptedCmp1;AcceptedCmp2;Complain;Z_CostContact;Z_Revenue;Response"
    ],
    "description": "### Context\n\nA response model can provide a significant boost to the efficiency of a marketing campaign by increasing responses or reducing expenses. The objective is to predict who will respond to an offer for a product or service\n\n\n### Content\n\nAcceptedCmp1 - 1 if customer accepted the offer in the 1st campaign, 0 otherwise \nAcceptedCmp2 - 1 if customer accepted the offer in the 2nd campaign, 0 otherwise \nAcceptedCmp3 - 1 if customer accepted the offer in the 3rd campaign, 0 otherwise \nAcceptedCmp4 - 1 if customer accepted the offer in the 4th campaign, 0 otherwise \nAcceptedCmp5 - 1 if customer accepted the offer in the 5th campaign, 0 otherwise \nResponse (target) - 1 if customer accepted the offer in the last campaign, 0 otherwise \nComplain - 1 if customer complained in the last 2 years\nDtCustomer - date of customer’s enrolment with the company\nEducation - customer’s level of education\nMarital - customer’s marital status\nKidhome - number of small children in customer’s household\n\u2028Teenhome - number of teenagers in customer’s household\n\u2028Income - customer’s yearly household income\nMntFishProducts - amount spent on fish products in the last 2 years\nMntMeatProducts - amount spent on meat products in the last 2 years\nMntFruits - amount spent on fruits products in the last 2 years\nMntSweetProducts - amount spent on sweet products in the last 2 years\nMntWines - amount spent on wine products in the last 2 years\nMntGoldProds - amount spent on gold products in the last 2 years\nNumDealsPurchases - number of purchases made with discount\nNumCatalogPurchases - number of purchases made using catalogue\nNumStorePurchases - number of purchases made directly in stores\nNumWebPurchases - number of purchases made through company’s web site\nNumWebVisitsMonth - number of visits to company’s web site in the last month\nRecency - number of days since the last purchase \n\n\n### Acknowledgements\n\nO. Parr-Rud. Business Analytics Using SAS Enterprise Guide and SAS Enterprise Miner. SAS Institute, 2014.\n\n\n### Inspiration\n\nThe main objective is to train a predictive model which allows the company to maximize the profit of the next marketing campaign.",
    "licenses": [
        {
            "hasName": true,
            "name": "other",
            "nameNullable": "other"
        }
    ],
    "null_count": 0,
    "num_entries": 2240,
    "row_count": 2240,
    "source": "kaggle",
    "tags": [
        "business",
        "marketing",
        "classification"
    ],
    "title": "Marketing Campaign",
    "topic": "education",
    "url": "kaggle.com/datasets/rodsaldanha/arketing-campaign",
    "usability": 0.9117647058823529
}